{"tx_hash": "CHh19BNoQvaqyH8vou9EiiEaUBqSVwtrwz8R7FWPbv9K", "action_id_social": "DsQExeRGghDosstjvybRysE7hJuYGZK8JXa2LoU56VUM-0-widget", "block_id": 98272619, "block_timestamp": "2023-08-07T11:50:32.284Z", "signer_id": "relayer.pagodaplatform.near", "widget_name": "SUPRASLOT88", "source_code": null, "metadata": {"description": "SUPRA SLOT 88  telah masuk dalam daftar situs akun pragmatic easy jackpot dan gacor demo slot yang telah mendapatkan lisensi resmi pagcor dan telah memberikan banyak sekali bonus new member terbesar bahkan permainan slot yang dapat memberikan uang nyata dan keuntungan besar kepada semua member yang berpatisipasi . \n\nSitus Supra Slot 88 Slot Gacor Easy Win kami dinobatkan sebagai salah satu situs terkeren. Itu sebabnya bosq telah mendaftarkan Slot Supra Slot 88 Gacor Online tempat Anda dapat menyetor dana. Semua ini hanya untuk mendapatkan semua keuntungan. Komitmen yang paling lengkap adalah permainan kami tidak pernah habis dan selalu ada ruang untuk pemain baru. Misalnya Anda ingin bermain judi casino atau permainan slot. Anda dapat memilih salah satu dari banyak permainan judi kartu kami. Contoh permainan judi yang bisa anda mainkan adalah Pay4D slots, Pragmatic Play, PG Soft, Habanero slots, CQ9, SpadeGaming, Joker Gaming, dan lainnya. Ini menjanjikan para pemain tidak bosan.\n\nSupra Slot 88 Gacor adalah pilihan situs judi Slot 88  Gacor Online di Indonesia yang menawarkan pilihan permainan online yang bagus . Pilihan permainan yang kami tawarkan berasal dari beberapa pilihan provider ternama yang terpercaya. Bahkan beberapa di antaranya menghadirkan dan menawarkan banyak pilihan permainan Slot 88 Gacor online dengan nilai RTP yang langit , sehingga memungkinkan siapa saja untuk bisa mendapatkan kemenangan dengan mudah di dalamnya. Inilah yang diharapkan dan diinginkan banyak pemain di mana mereka ingin bisa mendapatkan dan menghasilkan kemenangan mudah dengan keuntungan besar yang ditawarkan oleh situs-situs tersebut. Jadi Anda bisa bergabung dengan kami untuk mendapatkan penawaran menarik mulai dari akses mudah ke banyak perangkat online, berbagai metode cara transaksi dan banyak bonus promo yang ditawarkan.", "image": {"ipfs_cid": "bafkreicqa53fn42okhfhbvrgvttit4i46vzytwfdjsyyl4jifdoo4fzixu"}, "linktree": {"website": "joy.link/supraslot88"}, "name": "SUPRASLOT88 : Akun Supra Slot 88/ Link SupraSlot 88/ SupraSlot 88Terpercaya", "tags": {"daftarsupraslot-88": "", "link-supra-slot-88": "", "supra-slot-88": "", "supraslot": "", "supraslot-88": "", "supraslot88": ""}}, "branch": {"draft": null}, "widget_modules_used": null, "widget_url": "https://near.social/#/relayer.pagodaplatform.near/widget/SUPRASLOT88", "fact_widget_deployments_id": "2f2c7213d88ca380ed9c7e7781fdc0d2", "inserted_timestamp": "2024-03-07T05:24:05.087Z", "modified_timestamp": "2024-03-07T05:24:05.087Z", "__row_index": 0}