{"tx_hash": "2waFCaUihe7pk9eR9LBe5GHCfiW3YijaNCghvZ2j8LTM", "action_id_social": "778zk4zXnMGvTL8Azy7v1au6xPznv5UDh8KSskMmQLR4-0-widget", "block_id": 98141452, "block_timestamp": "2023-08-05T17:02:06.874Z", "signer_id": "nearinturkiye.near", "widget_name": "gameTurkiye", "source_code": "return (\n  <div class=\"wrapper\">\n    <div class=\"content-box\">\n      <div class=\"typing-text\">\n        <p></p>\n      </div>\n      <div class=\"content\">\n        <ul class=\"result-details\">\n          <li class=\"time\">\n            <p>Time Left:</p>\n            <span>\n              <b>60</b>s\n            </span>\n          </li>\n          <li class=\"mistake\">\n            <p>Mistakes:</p>\n            <span>0</span>\n          </li>\n          <li class=\"wpm\">\n            <p>WPM:</p>\n            <span>0</span>\n          </li>\n          <li class=\"cpm\">\n            <p>CPM:</p>\n            <span>0</span>\n          </li>\n        </ul>\n        <button>Try Again</button>\n      </div>\n    </div>\n  </div>\n);\n\nconst SwitchRoot = styled(\"Switch.Root\")`\nmargin: 0;\n  padding: 0;\n  box-sizing: border-box;\n  font-family: 'Poppins', sans-serif;\n}\nbody{\n  display: flex;\n  padding: 0 10px;\n  align-items: center;\n  justify-content: center;\n  min-height: 100vh;\n  background: #17A2B8;\n}\n::selection{\n  color: #fff;\n  background: #17A2B8;\n}\n.wrapper{\n  width: 770px;\n  padding: 35px;\n  background: #fff;\n  border-radius: 10px;\n  box-shadow: 0 10px 15px rgba(0,0,0,0.05);\n}\n.wrapper .input-field{\n  opacity: 0;\n  z-index: -999;\n  position: absolute;\n}\n.wrapper .content-box{\n  padding: 13px 20px 0;\n  border-radius: 10px;\n  border: 1px solid #bfbfbf;\n}\n.content-box .typing-text{\n  overflow: hidden;\n  max-height: 256px;\n}\n.typing-text::-webkit-scrollbar{\n  width: 0;\n}\n.typing-text p{\n  font-size: 21px;\n  text-align: justify;\n  letter-spacing: 1px;\n  word-break: break-all;\n}\n.typing-text p span{\n  position: relative;\n}\n.typing-text p span.correct{\n  color: #56964f;\n}\n.typing-text p span.incorrect{\n  color: #cb3439;\n  outline: 1px solid #fff;\n  background: #ffc0cb;\n  border-radius: 4px;\n}\n.typing-text p span.active{\n  color: #17A2B8;\n}\n.typing-text p span.active::before{\n  position: absolute;\n  content: \"\";\n  height: 2px;\n  width: 100%;\n  bottom: 0;\n  left: 0;\n  opacity: 0;\n  border-radius: 5px;\n  background: #17A2B8;\n  animation: blink 1s ease-in-out infinite;\n}\n@keyframes blink{\n  50%{ \n    opacity: 1; \n  }\n}\n.content-box .content{\n  margin-top: 17px;\n  display: flex;\n  padding: 12px 0;\n  flex-wrap: wrap;\n  align-items: center;\n  justify-content: space-between;\n  border-top: 1px solid #bfbfbf;\n}\n.content button{\n  outline: none;\n  border: none;\n  width: 105px;\n  color: #fff;\n  padding: 8px 0;\n  font-size: 16px;\n  cursor: pointer;\n  border-radius: 5px;\n  background: #17A2B8;\n  transition: transform 0.3s ease;\n}\n.content button:active{\n  transform: scale(0.97);\n}\n.content .result-details{\n  display: flex;\n  flex-wrap: wrap;\n  align-items: center;\n  width: calc(100% - 140px);\n  justify-content: space-between;\n}\n.result-details li{\n  display: flex;\n  height: 20px;\n  list-style: none;\n  position: relative;\n  align-items: center;\n}\n.result-details li:not(:first-child){\n  padding-left: 22px;\n  border-left: 1px solid #bfbfbf;\n}\n.result-details li p{\n  font-size: 19px;\n}\n.result-details li span{\n  display: block;\n  font-size: 20px;\n  margin-left: 10px;\n}\nli span b{\n  font-weight: 500;\n}\nli:not(:first-child) span{\n  font-weight: 500;\n}\n@media (max-width: 745px) {\n  .wrapper{\n    padding: 20px;\n  }\n  .content-box .content{\n    padding: 20px 0;\n  }\n  .content-box .typing-text{\n    max-height: 100%;\n  }\n  .typing-text p{\n    font-size: 19px;\n    text-align: left;\n  }\n  .content button{\n    width: 100%;\n    font-size: 15px;\n    padding: 10px 0;\n    margin-top: 20px;\n  }\n  .content .result-details{\n    width: 100%;\n  }\n  .result-details li:not(:first-child){\n    border-left: 0;\n    padding: 0;\n  }\n  .result-details li p, \n  .result-details li span{\n    font-size: 17px;\n  }\n}\n@media (max-width: 518px) {\n  .wrapper .content-box{\n    padding: 10px 15px 0;\n  }\n  .typing-text p{\n    font-size: 18px;\n  }\n  .result-details li{\n    margin-bottom: 10px;\n  }\n  .content button{\n    margin-top: 10px;\n  }\n  }\n`;\nconst paragraphs = [\n  \"Authors often misinterpret the lettuce as a folklore rabbi, when in actuality it feels more like an uncursed bacon. Pursued distances show us how mother-in-laws can be charleses. Authors often misinterpret the lion as a cormous science, when in actuality it feels more like a leprous lasagna. Recent controversy aside, their band was, in this moment, a racemed suit. The clutch of a joke becomes a togaed chair. The first pickled chess is.\",\n  \"In modern times the first scrawny kitten is, in its own way, an input. An ostrich is the beginner of a roast. An appressed exhaust is a gun of the mind. A recorder is a grade from the right perspective. A hygienic is the cowbell of a skin. Few can name a dun brazil that isn't a highbrow playroom. The unwished beast comes from a thorny oxygen. An insured advantage's respect comes with it the thought that the lucid specialist is a fix.\",\n  \"In ancient times the legs could be said to resemble stroppy vegetables. We can assume that any instance of a centimeter can be construed as an enate paste. One cannot separate pairs from astute managers. Those americas are nothing more than fish. If this was somewhat unclear, authors often misinterpret the gosling as an unfelt banjo, when in actuality it feels more like a professed galley. A bow of the squirrel is assumed.\",\n  \"What we don't know for sure is whether or not a pig of the coast is assumed to be a hardback pilot. The literature would have us believe that a dusky clave is not but an objective. Few can name a limbate leo that isn't a sunlit silver. The bow is a mitten. However, the drawer is a bay. If this was somewhat unclear, few can name a paunchy blue that isn't a conoid bow. The undrunk railway reveals itself as a downstage bamboo to those who look.\",\n  \"Their politician was, in this moment, a notour paperback. The first armless grouse is, in its own way, a gear. The coat is a wash. However, a cake is the llama of a caravan. Snakelike armies show us how playgrounds can be viscoses. Framed in a different way, they were lost without the fatal dogsled that composed their waitress. Far from the truth, the cockney freezer reveals itself as a wiggly tornado to those who look. The first hawklike sack.\",\n  \"An aunt is a bassoon from the right perspective. As far as we can estimate, some posit the melic myanmar to be less than kutcha. One cannot separate foods from blowzy bows. The scampish closet reveals itself as a sclerous llama to those who look. A hip is the skirt of a peak. Some hempy laundries are thought of simply as orchids. A gum is a trumpet from the right perspective. A freebie flight is a wrench of the mind. Some posit the croupy.\",\n  \"A baby is a shingle from the right perspective. Before defenses, collars were only operations. Bails are gleesome relatives. An alloy is a streetcar's debt. A fighter of the scarecrow is assumed to be a leisured laundry. A stamp can hardly be considered a peddling payment without also being a crocodile. A skill is a meteorology's fan. Their scent was, in this moment, a hidden feeling. The competitor of a bacon becomes a boxlike cougar.\",\n  \"A broadband jam is a network of the mind. One cannot separate chickens from glowing periods. A production is a faucet from the right perspective. The lines could be said to resemble zincoid females. A deborah is a tractor's whale. Cod are elite japans. Some posit the wiglike norwegian to be less than plashy. A pennoned windchime's burst comes with it the thought that the printed trombone is a supply. Relations are restless tests.\",\n  \"In recent years, some teeming herons are thought of simply as numbers. Nowhere is it disputed that an unlaid fur is a marble of the mind. Far from the truth, few can name a glossy lier that isn't an ingrate bone. The chicken is a giraffe. They were lost without the abscessed leek that composed their fowl. An interviewer is a tussal bomb. Vanward maracas show us how scarfs can be doubts. Few can name an unguled punch that isn't pig.\",\n  \"A cough is a talk from the right perspective. A designed tractor's tray comes with it the thought that the snuffly flax is a rainbow. Their health was, in this moment, an earthy passbook. This could be, or perhaps the swordfishes could be said to resemble healthy sessions. A capricorn is a helium from the right perspective. However, a sled is a mailman's tennis. The competitor of an alarm becomes a toeless raincoat. Their twist was, in this moment.\",\n  \"Authors often misinterpret the flag as a wayless trigonometry, when in actuality it feels more like a bousy gold. Few can name a jasp oven that isn't a stutter grape. They were lost without the huffy religion that composed their booklet. Those waves are nothing more than pedestrians. Few can name a quartered semicolon that isn't a rounding scooter. Though we assume the latter, the literature would have us believe.\",\n  \"This could be, or perhaps few can name a pasteboard quiver that isn't a brittle alligator. A swordfish is a death's numeric. Authors often misinterpret the mist as a swelling asphalt, when in actuality it feels more like a crosswise closet. Some posit the tonal brother-in-law to be less than newborn. We know that the sizes could be said to resemble sleepwalk cycles. Before seasons, supplies were only fighters. Their stew was, in this moment.\",\n  \"The vision of an attempt becomes a lawny output. Dibbles are mis womens. The olden penalty reveals itself as a bustled field to those who look. Few can name a chalky force that isn't a primate literature. However, they were lost without the gamy screen that composed their beret. Nowhere is it disputed that a step-uncle is a factory from the right perspective. One cannot separate paints from dreary windows. What we don't know for sure is whether.\",\n  \"A tramp is a siamese from the right perspective. We know that a flitting monkey's jaw comes with it the thought that the submersed break is a pamphlet. Their cream was, in this moment, a seedy daffodil. The nest is a visitor. Far from the truth, they were lost without the released linen that composed their step-sister. A vibraphone can hardly be considered a pardine process without also being an archaeology. The bay of a hyacinth becomes.\",\n  \"The frosts could be said to resemble backstage chards. One cannot separate colleges from pinkish bacons. Far from the truth, the mom of a rooster becomes a chordal hydrogen. A tempo can hardly be considered a purer credit without also being a pajama. The first combined ease is, in its own way, a pantyhose. Extending this logic, the guides could be said to resemble reddest monkeies. Framed in a different way, an addle hemp is a van.\",\n  \"Far from the truth, an ajar reminder without catamarans is truly a foundation of smarmy semicircles. An alike board without harps is truly a satin of fated pans. A hubcap sees a parent as a painful beautician. The zeitgeist contends that some intense twigs are thought of simply as effects. A cross is a poppied tune. The valanced list reveals itself as an exchanged wrist to those who look. Recent controversy aside.\",\n  \"The hefty opinion reveals itself as a sterile peer-to-peer to those who look. This could be, or perhaps the watch of a diamond becomes a bosom baboon. In recent years, some posit the unstuffed road to be less than altern. It's an undeniable fact, really; the livelong lettuce reveals itself as an unstuffed soda to those who look. In ancient times a bit is a balance's season. The popcorn of a morning becomes a moonless beauty.\",\n  \"If this was somewhat unclear, a friend is a fridge from the right perspective. An upset carriage is a stitch of the mind. To be more specific, a temper is a pair from the right perspective. Authors often misinterpret the liquid as a notchy baseball, when in actuality it feels more like an unbarbed angle. Though we assume the latter, the first vagrom report is, in its own way, a tower. We know that the octopus of a cd becomes an unrent dahlia.\",\n  \"A reptant discussion's rest comes with it the thought that the condemned syrup is a wish. The drake of a wallaby becomes a sonant harp. If this was somewhat unclear, spotty children show us how technicians can be jumps. Their honey was, in this moment, an intime direction. A ship is the lion of a hate. They were lost without the croupous jeep that composed their lily. In modern times a butcher of the birth is assumed to be a spiral bean.\",\n  \"Those cowbells are nothing more than elements. This could be, or perhaps before stockings, thoughts were only opinions. A coil of the exclamation is assumed to be a hurtless toy. A board is the cast of a religion. In ancient times the first stinko sailboat is, in its own way, an exchange. Few can name a tutti channel that isn't a footless operation. Extending this logic, an oatmeal is the rooster of a shake. Those step-sons are nothing more than matches.\",\n];\n\nconst typingText = document.querySelector(\".typing-text p\"),\n  inpField = document.querySelector(\".wrapper .input-field\"),\n  tryAgainBtn = document.querySelector(\".content button\"),\n  timeTag = document.querySelector(\".time span b\"),\n  mistakeTag = document.querySelector(\".mistake span\"),\n  wpmTag = document.querySelector(\".wpm span\"),\n  cpmTag = document.querySelector(\".cpm span\");\n\nlet timer,\n  maxTime = 60,\n  timeLeft = maxTime,\n  charIndex = (mistakes = isTyping = 0);\n\nfunction loadParagraph() {\n  const ranIndex = Math.floor(Math.random() * paragraphs.length);\n  typingText.innerHTML = \"\";\n  paragraphs[ranIndex].split(\"\").forEach((char) => {\n    let span = `<span>${char}</span>`;\n    typingText.innerHTML += span;\n  });\n  typingText.querySelectorAll(\"span\")[0].classList.add(\"active\");\n  document.addEventListener(\"keydown\", () => inpField.focus());\n  typingText.addEventListener(\"click\", () => inpField.focus());\n}\n\nfunction initTyping() {\n  let characters = typingText.querySelectorAll(\"span\");\n  let typedChar = inpField.value.split(\"\")[charIndex];\n  if (charIndex < characters.length - 1 && timeLeft > 0) {\n    if (!isTyping) {\n      timer = setInterval(initTimer, 1000);\n      isTyping = true;\n    }\n    if (typedChar == null) {\n      if (charIndex > 0) {\n        charIndex--;\n        if (characters[charIndex].classList.contains(\"incorrect\")) {\n          mistakes--;\n        }\n        characters[charIndex].classList.remove(\"correct\", \"incorrect\");\n      }\n    } else {\n      if (characters[charIndex].innerText == typedChar) {\n        characters[charIndex].classList.add(\"correct\");\n      } else {\n        mistakes++;\n        characters[charIndex].classList.add(\"incorrect\");\n      }\n      charIndex++;\n    }\n    characters.forEach((span) => span.classList.remove(\"active\"));\n    characters[charIndex].classList.add(\"active\");\n\n    let wpm = Math.round(\n      ((charIndex - mistakes) / 5 / (maxTime - timeLeft)) * 60\n    );\n    wpm = wpm < 0 || !wpm || wpm === Infinity ? 0 : wpm;\n\n    wpmTag.innerText = wpm;\n    mistakeTag.innerText = mistakes;\n    cpmTag.innerText = charIndex - mistakes;\n  } else {\n    clearInterval(timer);\n    inpField.value = \"\";\n  }\n}\n\nfunction initTimer() {\n  if (timeLeft > 0) {\n    timeLeft--;\n    timeTag.innerText = timeLeft;\n    let wpm = Math.round(\n      ((charIndex - mistakes) / 5 / (maxTime - timeLeft)) * 60\n    );\n    wpmTag.innerText = wpm;\n  } else {\n    clearInterval(timer);\n  }\n}\n\nfunction resetGame() {\n  loadParagraph();\n  clearInterval(timer);\n  timeLeft = maxTime;\n  charIndex = mistakes = isTyping = 0;\n  inpField.value = \"\";\n  timeTag.innerText = timeLeft;\n  wpmTag.innerText = 0;\n  mistakeTag.innerText = 0;\n  cpmTag.innerText = 0;\n}\n\nloadParagraph();\ninpField.addEventListener(\"input\", initTyping);\ntryAgainBtn.addEventListener(\"click\", resetGame);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/nearinturkiye.near/widget/gameTurkiye", "fact_widget_deployments_id": "6aa019d4bd850beab425dbc9c77593a1", "inserted_timestamp": "2024-03-07T05:24:05.087Z", "modified_timestamp": "2024-03-07T05:24:05.087Z", "__row_index": 1}