{"tx_hash": "BQnaSkjZKbJz3R17HDqj12LRWQKP3Bvwwffmj4bSjvBD", "action_id_social": "8yDtT5WfDsn1FWrUeymjP9txG1F9Zf8DLsLVC6zg7Kiz-0-widget", "block_id": 116757458, "block_timestamp": "2024-04-13T12:54:47.615Z", "signer_id": "v1.wireframes.near", "widget_name": "Components.Navigations.NavigationDetail.TopNavbarDetail", "source_code": "/* -------------------------------------------------------------------------- */\n/*\n __        ___           __                               \n \\ \\      / (_)_ __ ___ / _|_ __ __ _ _ __ ___   ___  ___ \n  \\ \\ /\\ / /| | '__/ _ \\ |_| '__/ _` | '_ ` _ \\ / _ \\/ __|\n   \\ V  V / | | | |  __/  _| | | (_| | | | | | |  __/\\__ \\\n    \\_/\\_/  |_|_|  \\___|_| |_|  \\__,_|_| |_| |_|\\___||___/\n\n  =========================================================\n  * Wireframes - v1.0.0\n  =========================================================\n  * Product Page: https://wireframes.design\n  =========================================================\n  * The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\n                                                                                 */\n/* -------------------------------------------------------------------------- */\n\nconst admin = \"/\";\nconst user = \"/\";\n\nconst data = {\n  logoHref: \"#\",\n  logoSrc: \"https://wireframes.design/wireframes-logo.png\",\n  logoAlt: \"wireframe logo\",\n  logoHeight: \"29px\",\n  logoWidth: \"152px\",\n  info: \"Jan 18-19 London\",\n  hideLocation: false,\n  companyName: \"\",\n  registerButton: \"\",\n  adminUrl: admin,\n  userUrl: user,\n  linksData: [\n    {\n      menuHref: \"#\",\n      menuName: \"Home\",\n    },\n    {\n      menuHref: \"#\",\n      menuName: \"About\",\n    },\n  ],\n};\n\nconst detail = `\nconst admin = \"/\";\nconst user = \"/\";\n\nconst data ={\n  logoHref : \"#\",\n  logoSrc : \"https://wireframes.design/wireframes-logo.png\",\n  logoAlt : \"wireframe logo\",\n  logoHeight:\"29px\",\n  logoWidth:\"152px\",\n  info:\"Jan 18-19 London\",\n  hideLocation:false,\n  companyName:\"\",\n  registerButton: \"\",\n  adminUrl: \"${admin}\",\n  userUrl: \"${user}\",\n};\nreturn(\n  <Widget src=\"v1.wireframes.near/widget/Components.Navigations.TopNavbar\" props={data}/>\n);`;\nconst explanation =\n  \"A top navbar, also known as a top navigation bar or simply a navbar, is a user interface element commonly found at the top of a webpage or application. It typically contains links, buttons, or other interactive elements that allow users to navigate to different sections of the website or access important features and pages.\";\n\nconst propsExplanation = [\n  {\n    title: \"logoHref\",\n    required: \"true\",\n    content:\n      \"You can use the logoHref props to specify the destination of a hyperlink, which is typically an anchor <a> element. This attribute determines the URL that the browser navigates to when the user clicks on the hyperlink. e.g.\",\n    code: `const data = {\n      logoHref : \"#\",\n    };`,\n  },\n  {\n    title: \"logoSrc\",\n    required: \"true\",\n    content:\n      \"You can use the logoSrc props to specify the source (URL) of external resources, such as images. e.g.\",\n    code: `const data = {\n      logoSrc : \"https://wireframes.design/wireframes-logo.png\",\n    };`,\n  },\n  {\n    title: \"logoAlt\",\n    required: \"true\",\n    content:\n      \"You can use the logoAlt props to provide alternative text for an image element. It stands for alternative text and is used to describe the content of the element when it cannot be displayed to the user. e.g.\",\n    code: `const data = {\n      logoAlt : \"company logo\",\n    };`,\n  },\n  {\n    title: \"logoHeight\",\n    content:\n      \"The logoHeight props is used to set the height of an image element. It determines the vertical size of the content box within the element's box model. e.g.\",\n    code: `const data = {\n      logoHeight : \"29px\",\n    };`,\n  },\n  {\n    title: \"logoWidth\",\n    content:\n      \"The logoWidth props is used to set the width of an image element. It determines the horizontal size of the content box within an element's box model. You can set the width using various units, such as pixels (px), percentages (%), em units (em), or other length units. e.g.\",\n    code: `const data = {\n      logoWidth : \"152px\",\n    };`,\n  },\n  {\n    title: \"info\",\n    content:\n      \"The term info typically refers to information or details provided to users within a user interface to convey important messages, instructions, or context. In web development, info can be presented in various forms, such as tooltips, info icons, help text, or informational messages. e.g.\",\n    code: `const data = {\n      info : \"Jan 18-19 London\",\n    };`,\n  },\n  {\n    title: \"hideLocation\",\n    content:\n      \"You can pass the value of hideLocation props as true or false to hide or unhide the info displayed at the right in the top navbar. e.g.\",\n    code: `const data = {\n      hideLocation : false,\n    };`,\n  },\n  {\n    title: \"companyName\",\n    content:\n      \"The companyName props refers to the name of a company or organization. The 'companyName' prop is used to display or refer to the name of the company associated with a website, application, or brand. e.g.\",\n    code: `const data = {\n      companyName : \"Wireframe\",\n    };`,\n  },\n  {\n    title: \"registerButton\",\n    content:\n      \"You can use the registerButton props to apply a button used in a user interface to initiate the registration process for a service, application, or platform. e.g.\",\n    code: `const data = {\n      registerButton : \"\",\n    };`,\n  },\n  {\n    title: \"adminUrl\",\n    content:\n      \"The term adminUrl likely refers to a URL that provides access to administrative or backend functionality of a system, website, or application. e.g.\",\n    code: `const data = {\n      adminUrl : admin,\n    };`,\n  },\n  {\n    title: \"userUrl\",\n    content:\n      \"The term userUrl likely refers to a URL that provides access to user-specific functionality or content within a system, website, or application. e.g.\",\n    code: `const data = {\n      userUrl : user,\n    };`,\n  },\n  {\n    title: \"inlineStyle\",\n    content: \"You will be able to add your Inline style here. e.g.\",\n    code: `const data = { \n      inlineStyle: { \n        fontSize: '16px',\n      }, \n    };`,\n  },\n  {\n    title: \"style\",\n    content:\n      \"You can use the style attribute to apply styles to components. e.g.\",\n    code: `const data = {\n      style:{ \n        margin-right: 'auto',\n        padding-right: '2%',\n      } \n    };`,\n    children: [\n      {\n        title: \"navZIndex\",\n        content:\n          \"The navZIndex props is used to controls the stacking order of positioned elements of navbar. It specifies the z-axis position of an element and determines whether it appears in front of or behind other elements. e.g.\",\n        code: `const data = {\n          style:{ \n            navZIndex: '10',\n          }, \n        };`,\n      },\n      {\n        title: \"navDisplay\",\n        content:\n          \"The navDisplay props is used to specify the type of box an element generates, controlling its layout behavior. It determines how an element is rendered in the document, affecting its visibility, positioning, and interaction with other elements. e.g.\",\n        code: `const data = {\n          style:{ \n            navDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"navAlignItems\",\n        content:\n          \"The navAlignItems props is used to define how flex items are aligned along the cross axis of their flex container in navbar. It applies to flex containers, which are elements with a display property set to flex or inline-flex. e.g.\",\n        code: `const data = {\n          style:{ \n            navAlignItems: 'center',\n          }, \n        };`,\n      },\n      {\n        title: \"navJustifyContent\",\n        content:\n          \"The navJustifyContent props is used to align flex items along the main axis of the flex container. It determines how remaining space in the flex container is distributed among the flex items when there is extra space available. e.g.\",\n        code: `const data = {\n          style:{ \n            navJustifyContent: 'space-between',\n          }, \n        };`,\n      },\n      {\n        title: \"navPadding\",\n        content:\n          \"The navPadding props is used to define the space between the content of an element and its borders. It determines the internal spacing within an element and contributes to its overall size. Padding can be applied to all four sides of an element (top, right, bottom, left) or individually. e.g.\",\n        code: `const data = {\n          style:{ \n            navPadding: '0 10px',\n          }, \n        };`,\n      },\n      {\n        title: \"navFlex\",\n        content:\n          \"The navFlex props is refers property display: flex; and its associated flexbox layout model. e.g.\",\n        code: `const data = {\n          style:{ \n            navFlex: 'none',\n          }, \n        };`,\n      },\n      {\n        title: \"navOrder\",\n        content:\n          \"The navOrder props is used in conjunction with Flexbox to control the order in which flex items are displayed within a flex container. e.g.\",\n        code: `const data = {\n          style:{ \n            navOrder: '0',\n          }, \n        };`,\n      },\n      {\n        title: \"navAlignSelf\",\n        content:\n          \"The navAlignSelf props is used within a Flexbox layout to control the alignment of individual flex items along the cross axis, overriding the default alignment set by the container's align-items property for that specific item. e.g.\",\n        code: `const data = {\n          style:{ \n            navAlignSelf: 'stretch',\n          }, \n        };`,\n      },\n      {\n        title: \"navFlexGrow\",\n        content:\n          \"The navFlexGrow props is used within a Flexbox layout to specify how much a flex item should grow relative to other flex items within the same flex container when there is available space along the main axis. e.g.\",\n        code: `const data = {\n          style:{ \n            navFlexGrow: '0',\n          }, \n        };`,\n      },\n      {\n        title: \"navPosition\",\n        content:\n          \"The navPosition props is used to specify the positioning method of an element relative to its containing element or the document itself. It allows you to control the placement of a navbar element within the layout of a webpage. e.g.\",\n        code: `const data = {\n          style:{ \n            navPosition: 'sticky',\n          }, \n        };`,\n      },\n      {\n        title: \"navTop\",\n        content:\n          \"The navTop props is used to specify the vertical position of a positioned element relative to its containing block. It applies only to elements with a position value other than static (e.g., relative, absolute, fixed, or sticky). e.g.\",\n        code: `const data = {\n          style:{ \n            navTop: '0',\n          }, \n        };`,\n      },\n      {\n        title: \"navHeight\",\n        content:\n          \"The navTop props is used to specify the vertical position of a positioned element relative to its containing block. It applies only to elements with a position value other than static (e.g., relative, absolute, fixed, or sticky). e.g.\",\n        code: `const data = {\n          style:{ \n            navHeight: '10vh',\n          }, \n        };`,\n      },\n      {\n        title: \"navMinHeight\",\n        content:\n          \"The navMinHeight props is used to set the minimum height of a navbar element. It ensures that the height of the element does not shrink below the specified minimum value, even if the content or other styles would otherwise make it smaller. e.g.\",\n        code: `const data = {\n          style:{ \n            navMinHeight: '10vh',\n          }, \n        };`,\n      },\n      {\n        title: \"navBoxShadow\",\n        content:\n          \"The navBoxShadow props is used to add shadow effects to the navbar element's box. It allows you to create both inner shadows and outer shadows, providing depth and dimension to the appearance of elements on a webpage. e.g.\",\n        code: `const data = {\n          style:{ \n            navBoxShadow: 'rgba(0, 0, 0, 0.35) 0px 5px 15px',\n          }, \n        };`,\n      },\n      {\n        title: \"navBackdropFilter\",\n        content:\n          \"The navBackdropFilter props is used to apply graphical effects to the area behind the navbar element. It allows you to blur or color-shift the background behind an element, creating effects such as frosted glass or applying color filters to the content behind the element. e.g.\",\n        code: `const data = {\n          style:{ \n            navBackdropFilter: 'blur(8px)',\n          }, \n        };`,\n      },\n      {\n        title: \"logoDisplay\",\n        content:\n          \"The logoDisplay props is used to specify the type of box an element generates, controlling its layout behavior. It determines how an element is rendered in the document, affecting its visibility, positioning, and interaction with other elements. e.g.\",\n        code: `const data = {\n          style:{ \n            logoDisplay: 'block',\n          }, \n        };`,\n      },\n      {\n        title: \"Width\",\n        content:\n          \"The Width property is used to set the width of area in which logo is placed. It determines the horizontal size of the content box within an element's box model. You can set the width using various units, such as pixels (px), percentages (%), em units (em), or other length units. e.g.\",\n        code: `const data = {\n          style:{ \n            Width: '5em',\n          }, \n        };`,\n      },\n      {\n        title: \"logoPadding\",\n        content:\n          \"The logoPadding props is used to define the space between the content of an element and its borders. It determines the internal spacing within an element and contributes to its overall size. Padding can be applied to all four sides of an element (top, right, bottom, left) or individually. e.g.\",\n        code: `const data = {\n          style:{ \n            logoPadding: '0px',\n          }, \n        };`,\n      },\n      {\n        title: \"logoGap\",\n        content:\n          \"The logoGap props is used to specify the spacing between flex items in navbar. It is part of the Flexbox layout model and provides a convenient way to add consistent spacing between items without the need for additional margin or padding styles. e.g.\",\n        code: `const data = {\n          style:{ \n            logoGap: '0.7em',\n          }, \n        };`,\n      },\n      {\n        title: \"logoFontStyle\",\n        content:\n          \"The logoFontStyle props is used to specify the style of the font for a text element. It allows you to control whether the text should be displayed in a normal, italic, or oblique style. e.g.\",\n        code: `const data = {\n          style:{ \n            logoFontStyle: 'normal',\n          }, \n        };`,\n      },\n      {\n        title: \"logoFontWeight\",\n        content:\n          \"The logoFontWeight props is used to set the thickness or boldness of the characters in text. It accepts numeric values, font weight keywords, or named values to specify the level of boldness. e.g.\",\n        code: `const data = {\n          style:{ \n            logoFontWeight: '700',\n          }, \n        };`,\n      },\n      {\n        title: \"logoFontSize\",\n        content:\n          \"The logoFontSize props is used to set the size of the text content within an element. It specifies the height of the font in pixels, em units, percentages, or other length units. e.g.\",\n        code: `const data = {\n          style:{ \n            logoFontSize: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"logoLineHeight\",\n        content:\n          \"The logoLineHeight props is used to specify the height of each line of text within an element. It defines the amount of vertical space between lines, affecting the spacing between the baselines of adjacent lines of text. e.g.\",\n        code: `const data = {\n          style:{ \n            logoLineHeight: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"logoFontColor\",\n        content:\n          \"The logoFontColor props is used to the color property, which is commonly used to set the text color of an element. e.g.\",\n        code: `const data = {\n          style:{ \n            logoFontColor: '#11181c',\n          }, \n        };`,\n      },\n      {\n        title: \"logoHoverFontColor\",\n        content:\n          \"The logoHoverFontColor typically refers to changing the color of an element when the user hovers over it. e.g.\",\n        code: `const data = {\n          style:{ \n            logoHoverFontColor: '#11181c',\n          }, \n        };`,\n      },\n      {\n        title: \"actionAreaDisplay\",\n        content:\n          \"The actionAreaDisplay props is used to specify the type of box an element generates, controlling its layout behavior. It determines how an element is rendered in the document, affecting its visibility, positioning, and interaction with other elements. e.g.\",\n        code: `const data = {\n          style:{ \n            actionAreaDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"actionAreaJustifyContent\",\n        content:\n          \"The actionAreaJustifyContent props is used to align flex items along the main axis of the flex container. It determines how remaining space in the flex container is distributed among the flex items when there is extra space available. e.g.\",\n        code: `const data = {\n          style:{ \n            actionAreaJustifyContent: 'flex-end',\n          }, \n        };`,\n      },\n      {\n        title: \"actionAreaAlignItems\",\n        content:\n          \"The actionAreaAlignItems props is used to define how flex items are aligned along the cross axis of their flex container. It applies to flex containers, which are elements with a display property set to flex or inline-flex. e.g.\",\n        code: `const data = {\n          style:{ \n            actionAreaAlignItems: 'flex-start',\n          }, \n        };`,\n      },\n      {\n        title: \"actionAreaPadding\",\n        content:\n          \"The actionAreaPadding props is used to define the space between the content of an element and its borders. It determines the internal spacing within an element and contributes to its overall size. Padding can be applied to all four sides of an element (top, right, bottom, left) or individually. e.g.\",\n        code: `const data = {\n          style:{ \n            actionAreaPadding: '0px',\n          }, \n        };`,\n      },\n      {\n        title: \"actionAreaGap\",\n        content:\n          \"The actionAreaGap props is used to specify the spacing between flex items. It is part of the Flexbox layout model and provides a convenient way to add consistent spacing between items without the need for additional margin or padding styles. e.g.\",\n        code: `const data = {\n          style:{ \n            actionAreaGap: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"infoDisplay\",\n        content:\n          \"The infoDisplay props is used to specify the type of box an element generates, controlling its layout behavior. It determines how an element is rendered in the document, affecting its visibility, positioning, and interaction with other elements. e.g.\",\n        code: `const data = {\n          style:{ \n            infoDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"infoAlignItems\",\n        content:\n          \"The infoAlignItems props is used to define how flex items are aligned along the cross axis of their flex container. It applies to flex containers, which are elements with a display property set to flex or inline-flex. e.g.\",\n        code: `const data = {\n          style:{ \n            infoAlignItems: 'center',\n          }, \n        };`,\n      },\n      {\n        title: \"infoPadding\",\n        content:\n          \"The infoPadding props is used to define the space between the content of an element and its borders. It determines the internal spacing within an element and contributes to its overall size. Padding can be applied to all four sides of an element (top, right, bottom, left) or individually. e.g.\",\n        code: `const data = {\n          style:{ \n            infoPadding: '0px',\n          }, \n        };`,\n      },\n      {\n        title: \"infoGap\",\n        content:\n          \"The infoGap props is used to specify the spacing between flex items. It is part of the Flexbox layout model and provides a convenient way to add consistent spacing between items without the need for additional margin or padding styles. e.g.\",\n        code: `const data = {\n          style:{ \n            infoGap: '0.5em',\n          }, \n        };`,\n      },\n      {\n        title: \"infoFlex\",\n        content:\n          \"The infoFlex props is refers property display: flex; and its associated flexbox layout model. e.g.\",\n        code: `const data = {\n          style:{ \n            infoFlex: 'none',\n          }, \n        };`,\n      },\n      {\n        title: \"infoOrder\",\n        content:\n          \"The infoOrder props is used in conjunction with Flexbox to control the order in which flex items are displayed within a flex container. e.g.\",\n        code: `const data = {\n          style:{ \n            infoOrder: '0',\n          }, \n        };`,\n      },\n      {\n        title: \"infoAlignSelf\",\n        content:\n          \"The infoAlignSelf props is used within a Flexbox layout to control the alignment of individual flex items along the cross axis, overriding the default alignment set by the container's align-items property for that specific item. e.g.\",\n        code: `const data = {\n          style:{ \n            infoAlignSelf: 'stretch',\n          }, \n        };`,\n      },\n      {\n        title: \"infoFontFamily\",\n        content:\n          \"The infoFontFamily props is used to define the typeface or font family that should be applied to the text content within an element. It specifies a prioritized list of font family names and/or generic family names. e.g.\",\n        code: `const data = {\n          style:{ \n            infoFontFamily: 'Mona Sans',\n          }, \n        };`,\n      },\n      {\n        title: \"infoFontStyle\",\n        content:\n          \"The infoFontStyle props is used to specify the style of the font for a text element. It allows you to control whether the text should be displayed in a normal, italic, or oblique style. e.g.\",\n        code: `const data = {\n          style:{ \n            infoFontStyle: 'normal',\n          }, \n        };`,\n      },\n      {\n        title: \"infoFontWeight\",\n        content:\n          \"The infoFontWeight props is used to set the thickness or boldness of the characters in text. It accepts numeric values, font weight keywords, or named values to specify the level of boldness. e.g.\",\n        code: `const data = {\n          style:{ \n            infoFontWeight: '500',\n          }, \n        };`,\n      },\n      {\n        title: \"infoFontSize\",\n        content:\n          \"The infoFontSize props is used to set the size of the text content within an element. It specifies the height of the font in pixels, em units, percentages, or other length units. e.g.\",\n        code: `const data = {\n          style:{ \n            infoFontSize: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"infoLineHeight\",\n        content:\n          \"The infoLineHeight props is used to specify the height of each line of text within an element. It defines the amount of vertical space between lines, affecting the spacing between the baselines of adjacent lines of text. e.g.\",\n        code: `const data = {\n          style:{ \n            infoLineHeight: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"infoTextAlign\",\n        content:\n          \"The infoTextAlign props is used to specify the horizontal alignment of text within its containing element. It determines how text is positioned within the box of the element, whether it's aligned to the left, right, centered, or justified. e.g.\",\n        code: `const data = {\n          style:{ \n            infoTextAlign: 'right',\n          }, \n        };`,\n      },\n      {\n        title: \"infoFontColor\",\n        content:\n          \"The infoFontColor props is used to the color property, which is commonly used to set the text color of an element. e.g.\",\n        code: `const data = {\n          style:{ \n            infoFontColor: '#011340',\n          }, \n        };`,\n      },\n      {\n        title: \"labelDisplay\",\n        content:\n          \"The labelDisplay props is used to specify the type of box an element generates, controlling its layout behavior. It determines how an element is rendered in the document, affecting its visibility, positioning, and interaction with other elements. e.g.\",\n        code: `const data = {\n          style:{ \n            labelDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"labelAlignItems\",\n        content:\n          \"The labelAlignItems props is used to define how flex items are aligned along the cross axis of their flex container. It applies to flex containers, which are elements with a display property set to flex or inline-flex. e.g.\",\n        code: `const data = {\n          style:{ \n            labelAlignItems: 'center',\n          }, \n        };`,\n      },\n      {\n        title: \"labelPadding\",\n        content:\n          \"The labelPadding props is used to define the space between the content of an element and its borders. It determines the internal spacing within an element and contributes to its overall size. Padding can be applied to all four sides of an element (top, right, bottom, left) or individually. e.g.\",\n        code: `const data = {\n          style:{ \n            labelPadding: '0px',\n          }, \n        };`,\n      },\n      {\n        title: \"labelGap\",\n        content:\n          \"The labelGap props is used to specify the spacing between flex items. It is part of the Flexbox layout model and provides a convenient way to add consistent spacing between items without the need for additional margin or padding styles. e.g.\",\n        code: `const data = {\n          style:{ \n            labelGap: '0.5em',\n          }, \n        };`,\n      },\n      {\n        title: \"labelFlex\",\n        content:\n          \"The labelFlex props is refers property display: flex; and its associated flexbox layout model. e.g.\",\n        code: `const data = {\n          style:{ \n            labelFlex: 'none',\n          }, \n        };`,\n      },\n      {\n        title: \"labelOrder\",\n        content:\n          \"The labelOrder props is used in conjunction with Flexbox to control the order in which flex items are displayed within a flex container. e.g.\",\n        code: `const data = {\n          style:{ \n            labelOrder: '0',\n          }, \n        };`,\n      },\n      {\n        title: \"labelAlignSelf\",\n        content:\n          \"The labelAlignSelf props is used within a Flexbox layout to control the alignment of individual flex items along the cross axis, overriding the default alignment set by the container's align-items property for that specific item. e.g.\",\n        code: `const data = {\n          style:{ \n            labelAlignSelf: 'stretch',\n          }, \n        };`,\n      },\n      {\n        title: \"labelFontFamily\",\n        content:\n          \"The labelFontFamily props is used to define the typeface or font family that should be applied to the text content within an element. It specifies a prioritized list of font family names and/or generic family names. e.g.\",\n        code: `const data = {\n          style:{ \n            labelFontFamily: 'Mona Sans',\n          }, \n        };`,\n      },\n      {\n        title: \"labelFontStyle\",\n        content:\n          \"The labelFontStyle props is used to specify the style of the font for a text element. It allows you to control whether the text should be displayed in a normal, italic, or oblique style. e.g.\",\n        code: `const data = {\n          style:{ \n            labelFontStyle: 'normal',\n          }, \n        };`,\n      },\n      {\n        title: \"labelFontWeight\",\n        content:\n          \"The labelFontWeight props is used to set the thickness or boldness of the characters in text. It accepts numeric values, font weight keywords, or named values to specify the level of boldness. e.g.\",\n        code: `const data = {\n          style:{ \n            labelFontWeight: '500',\n          }, \n        };`,\n      },\n      {\n        title: \"labelFontSize\",\n        content:\n          \"The labelFontSize props is used to set the size of the text content within an element. It specifies the height of the font in pixels, em units, percentages, or other length units. e.g.\",\n        code: `const data = {\n          style:{ \n            labelFontSize: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"labelLineHeight\",\n        content:\n          \"The labelLineHeight props is used to specify the height of each line of text within an element. It defines the amount of vertical space between lines, affecting the spacing between the baselines of adjacent lines of text. e.g.\",\n        code: `const data = {\n          style:{ \n            labelLineHeight: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"labelTextAlign\",\n        content:\n          \"The labelTextAlign props is used to specify the horizontal alignment of text within its containing element. It determines how text is positioned within the box of the element, whether it's aligned to the left, right, centered, or justified. e.g.\",\n        code: `const data = {\n          style:{ \n            labelTextAlign: 'right',\n          }, \n        };`,\n      },\n      {\n        title: \"labelFontColor\",\n        content:\n          \"The labelFontColor props is used to the color property, which is commonly used to set the text color of an element. e.g.\",\n        code: `const data = {\n          style:{ \n            labelFontColor: '#011340',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoDisplay\",\n        content:\n          \"The accLogoDisplay props is used to specify the type of box an element generates, controlling its layout behavior. It determines how an element is rendered in the document, affecting its visibility, positioning, and interaction with other elements. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoDisplay: 'block',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoPadding\",\n        content:\n          \"The accLogoPadding props is used to define the space between the content of an element and its borders. It determines the internal spacing within an element and contributes to its overall size. Padding can be applied to all four sides of an element (top, right, bottom, left) or individually. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoPadding: '0px',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoGap\",\n        content:\n          \"The accLogoGap props is used to specify the spacing between flex items in navbar. It is part of the Flexbox layout model and provides a convenient way to add consistent spacing between items without the need for additional margin or padding styles. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoGap: '0.7em',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoFontStyle\",\n        content:\n          \"The accLogoFontStyle props is used to specify the style of the font for a text element. It allows you to control whether the text should be displayed in a normal, italic, or oblique style. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoFontStyle: 'normal',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoFontWeight\",\n        content:\n          \"The accLogoFontWeight props is used to set the thickness or boldness of the characters in text. It accepts numeric values, font weight keywords, or named values to specify the level of boldness. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoFontWeight: '700',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoFontSize\",\n        content:\n          \"The accLogoFontSize props is used to set the size of the text content within an element. It specifies the height of the font in pixels, em units, percentages, or other length units. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoFontSize: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoLineHeight\",\n        content:\n          \"The accLogoLineHeight props is used to specify the height of each line of text within an element. It defines the amount of vertical space between lines, affecting the spacing between the baselines of adjacent lines of text. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoLineHeight: '1em',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoFontColor\",\n        content:\n          \"The accLogoFontColor props is used to the color property, which is commonly used to set the text color of an element. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoFontColor: '#11181c',\n          }, \n        };`,\n      },\n      {\n        title: \"accLogoHoverFontColor\",\n        content:\n          \"The accLogoHoverFontColor typically refers to changing the color of an element when the user hovers over it. e.g.\",\n        code: `const data = {\n          style:{ \n            accLogoHoverFontColor: '#11181c',\n          }, \n        };`,\n      },\n    ],\n  },\n];\n\nconst props = {\n  copyBtn: detail,\n  component: (\n    <div className=\"row\">\n      <Widget\n        src={`v1.wireframes.near/widget/Components.Navigations.TopNavbar`}\n        props={data}\n      />\n    </div>\n  ),\n  text: detail,\n  explanation: explanation,\n  propsExplanation: propsExplanation,\n  displayLearningCard: \"full\",\n};\n\nreturn (\n  <>\n    <Widget\n      src={`v1.wireframes.near/widget/Components.Learning.LearningCard`}\n      props={props}\n    />\n  </>\n);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/v1.wireframes.near/widget/Components.Navigations.NavigationDetail.TopNavbarDetail", "fact_widget_deployments_id": "c9e04ab3fa3dbb672b96e0a7cdcb6f7a", "inserted_timestamp": "2024-04-13T14:37:28.463Z", "modified_timestamp": "2024-04-13T14:37:28.463Z", "__row_index": 0}