{"tx_hash": "Hb2BYkPFM2ZfiUxwd6j4FzYTcv15rW6y5YGvfWFxBiLY", "action_id_social": "Fbk79CwqfQm6C661NXSZnvDy36zunn7G9cC1ZdJTV5kq-0-widget", "block_id": 120147115, "block_timestamp": "2024-05-31T17:04:18.453Z", "signer_id": "trysui.near", "widget_name": "page.home", "source_code": "const Container = styled.div`\n  display: flex;\n  flex-direction: column;\n  flex: 1;\n  padding: 20px;\n  min-height: 80vh;\n`;\nconst Button = styled.button`\n  padding: 12px 16px;\n  border: none;\n  border-radius: 4px;\n  background-color: #000;\n  color: #a5a5a5;\n  font-size: 14px;\n  cursor: pointer;\n  transition: background-color 0.3s ease;\n  &:hover {\n    background-color: #1c1a1a;\n  }\n`;\nconst StlyedInput = styled.input`\n  color: black;\n  padding: 4px;\n`;\nconst Dropdown = styled.select`\n  background-color: #1c1c1c;\n  width: 300px;\n  height: 47px;\n  padding: 10px 20px 10px 20px;\n  border: 1px solid #444;\n`;\nconst OptionComponent = styled.div`\n  padding: 20px;\n  border-radius: 4px;\n  width: 80%;\n  text-align: center;\n  display: flex;\n  flex-direction: column;\n  justify-content: center;\n  align-items: center;\n`;\nconst Separator = styled.div`\n  height: 10px;\n  width: 100%;\n`;\nconst MonospaceText = styled.span`\n  font-family: monospace;\n`;\nreturn (\n  <Container>\n    <br />\n    <h3>Welcome!</h3>\n    <p>\n      Check out the{\" \"}\n      <Link to={`/trysui.near/widget/Index?page=library`}>library</Link> of Sui\n      components to use in your app, then go to the{\" \"}\n      <Link to={`/trysui.near/widget/Index?page=sandbox`}>sandbox</Link> and try\n      them out.\n    </p>\n    <br />\n    <br />\n    <h2>About</h2>\n    <h5>Building Blocks for Deep Integrations</h5>\n    <p>\n      Our hackathon project combines the power of Sui packages with a flexible\n      sandbox running on the NEAR blockchain operating system. Together, we can\n      experiment with better ways to build!\n    </p>\n    <p>\n      <b>Problem:</b> Even with such great documentation, onboarding developers\n      to Sui and Enoki requires considerable time installing, configuring, and\n      managing dependencies.\n    </p>\n    <p>\n      <b>Solution:</b> Web components with pre-installed custom elements lower\n      the barriers to entry for Sui developers. These highly accessible\n      resources could help more and more people learn to create applications\n      with Enoki, along with other tools for building on Sui.\n    </p>\n    <p>\n      <i>\n        Not only does our bos-sui-webcomponent make it easier for builders to\n        create apps with Enoki and other Sui tooling, but also, it is a reusable\n        and customizable component itself.\n      </i>\n    </p>\n    <p>\n      During the hackathon, Evan Cheng inspired us to reimagine how builders\n      interact with software, and specifically, our main goals were to improve\n      Sui onboarding processes and minimize the learning curve for builders.\n    </p>\n    <p>\n      <b>Overview:</b> Our project is made to demonstrate how open web\n      components can enhance functionality, usability, and scalability of\n      applications built on Sui.\n    </p>\n    <h3>Features:</h3>\n    <ul>\n      <li>\n        <b>ConnectButton</b> ~ for utilizing zkLogin through the UI Kit’s\n        “ConnectButton”\n      </li>\n      <li>\n        <b>EnokiFlow</b> ~ for submitting transactions to the Enoki Flow\n      </li>\n      <li>\n        <b>SuiClientQuery</b> ~ for querying and interacting with account data\n      </li>\n      <li>\n        <b>SuiSigner</b> ~ for signing transactions\n      </li>\n    </ul>\n    <h3>Benefits:</h3>\n    <ul>\n      <li>\n        <b>Ease of Use:</b> Our custom VM elements provide a straightforward way\n        for developers to start building with Sui and Enoki, reducing the time\n        and effort needed for setup.\n      </li>\n      <li>\n        <b>Quality of Developer Experience:</b> Our solution aims to improve\n        success rate of onboarding builders to Sui Typescript SDK, Enoki, etc.\n        pre-configured components and a user-friendly environment for building\n        and testing applications.\n      </li>\n      <li>\n        <b>Framework Compatibility:</b> Web components, as a web standard,\n        enable support across all frameworks. This ensures seamless integration\n        and support, no matter the stack, making it easier for developers to\n        incorporate Sui and Enoki into their existing projects.\n      </li>\n    </ul>\n    <p>\n      <h5>Implementation:</h5> We deployed on the Sui and NEAR testnets,\n      showcasing the interoperability and unprecedented capabilities of our\n      integrations. The product works like a documentation site with an online\n      IDE (integrated developer environment) built-in. It offers the ability to\n      build and deploy apps directly from the application, so developers can\n      focus on shipping. Hopefully, this project will result in more developers\n      building Sui apps and greater usage of zkLogin for onboarding the masses.\n    </p>\n    <br />\n    <h3>Next Steps:</h3>\n    <p>\n      Moving forward, the goal is to support an integrated testing environment\n      for smart contracts. This approach facilitates prototyping and open\n      collaboration across teams / organizations.\n    </p>\n    <p>\n      This project showcases how to achieve a synergistic effect by launching\n      Sui apps with on-chain front ends on NEAR, cultivating shared\n      opportunities to generally improve developer experience. By educating\n      builders to use modular web components, we are contributing to mass\n      adoption, impact, and evolution of blockchain technology.\n    </p>\n    <h2>Technical Explanation:</h2>\n    <p>\n      This near-bos-webcomponent is essentially a decentralized React app with\n      the near-social-vm installed, along with Enoki and Sui dev tools\n      integrated. We deployed to web4 in order to provide a live sandbox for Sui\n      builders. See it live at trysui.near.page!\n    </p>\n    <p>\n      The Sui stack was especially suitable for this implementation because of\n      how the hooks and providers are structured, as well as the existing UI kit\n      and patterns it follows. For example, the simple ConnectButton and wallet\n      persistence are handled by the providers themselves, rather than managed\n      manually. This made for an easy integration. We greatly benefited from the\n      modularity of the functions, given how Sui separates wallet connection\n      from transaction building and signing. Also, Sui provided helpers for\n      querying and displaying data.\n    </p>\n    <a href=\"https://www.canva.com/design/DAGGy7IpEBM/mwE8rYsJ30WLVcO3hAkB7w/edit\">\n      <h5>Canva Slides</h5>\n    </a>\n    <a href=\"https://github.com/nearbuilders/bos-sui-webcomponent\">\n      <h5>GitHub</h5>\n    </a>\n  </Container>\n);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/trysui.near/widget/page.home", "fact_widget_deployments_id": "25f60c014283a6eee4fd7cca14c457bb", "inserted_timestamp": "2024-05-31T18:41:34.069Z", "modified_timestamp": "2024-05-31T18:41:34.069Z", "__row_index": 5}