{"tx_hash": "B9ehBVfKixjdJd6Ea7n3vVvWtTs8hELuUaEWbfiZVmC3", "action_id_social": "CgsPMqRHqRgTvSyVoZDWu44fp7MSGbx1P4aomRR1XJNW-0-widget", "block_id": 115852936, "block_timestamp": "2024-03-31T13:02:24.956Z", "signer_id": "palomaetienne.near", "widget_name": "New-Draft-0", "source_code": "return (\r\n  <div>\r\n    Dao Ashe has applied for quadrantic funding. What is it? It is a\r\n    crowd-funding mechanism that amplifies available resources by inviting\r\n    community members to make donations (big or small) that act as votes on\r\n    where to allocate funds. The broader the support, the bigger the match! We\r\n    believe that DAO Ashe's mission to nurture diverse artists' self-expression\r\n    on the blockchain, alongside offering a community for marginalized and\r\n    isolated individuals, is aligned with unlocking the universal potential of\r\n    blockchain technology. Through promoting inclusivity and community building,\r\n    DAO Ashe contributes to the democratisation of access and fosters global\r\n    collaboration within the blockchain ecosystem. This is the link to apply:\r\n    https://bos.potlock.io/?tab=pot&potId=creatives.v1.potfactory.potlock.near&nav=applications\r\n    Please, watch out, we'll let you know when to donate from next week :) If\r\n    you haven't yet, read Potlock's Announcement: We are proud to announce the\r\n    first quadratic funding round on #NEAR for #Creative Public Goods, sponsored\r\n    by 🖼️ CreativesDAO. We advise all grassroots DAO communities to apply to it\r\n    through Potlock. The goals of the Potlock round are: - Drive more creative\r\n    use cases and public goods to the NEAR ecosystem - Allow for a bottom up\r\n    approach for communities with traction to get recognition to support -\r\n    Provide discovery for NFT and builders communities behind causes they can\r\n    get behind Requirements You are a public good = You provide more valuation\r\n    creation than value capture You are Project that - preserves cultural\r\n    centers - uses art for healing - uses art for fundraising for other causes -\r\n    uses art for education and awareness for critical issues - promotes\r\n    sustainable art - builds creative tech - provides art for free in different\r\n    areas - supports artists and creatives experiences 💰 $10,000 in the\r\n    matching pool (with the option to add more) This is the first in a series of\r\n    quadratic funding rounds in the upcoming months (👀 more alpha to come). 🗳️\r\n    Applications open up 🗓️ Monday, and matched donations starts the next Monday\r\n    (Feb 19th). 📚 Read more\r\n    https://blog.potlock.org/10-000-for-creative-public-goods-via-quadratic-funding-on-potlock-75777f6b8d49\r\n    🦆 https://twitter.com/potlock_/status/1756093316939075888 @potlock.near\r\n    @ndcplug.near @neardigitalcollective.near @creativesdao.sputnik-dao.near\r\n    @banyanus.near @minorityprogrammers.near @chloethedevnrc.near\r\n    @research-collective.near @chloe.near{\" \"}\r\n  </div>\r\n);\r\n", "metadata": {"description": "DAO ASHE is the first international Web3 community for Black, Indigenous, Latinx and People of Colour (BIPOC), neurodiverse and LGBTQI+ artists, as well as allies.\n\nSince October 2022 we have established a Discord channel, built a strong Twitter presence and organised on-boarding and educational events.\n\nOur ongoing NFT exhibition features Afro/Latinx/Indigenous Futurism themed art, and we need support to reach DAO members, host IRL events and buidl new projects with our creativity.", "image": {"ipfs_cid": "bafkreiebtzfi3xb7wb7rmqhocg5q56mijaiwxv4jsiojr45ppy2iagvws4"}, "linktree": {"website": "daoashe.near.social"}, "name": "Dao Ashe", "tags": {"ai-art": "", "bipoc": "", "community": "", "creatives": "", "dao": "", "degen": "", "education": "", "founder": "", "latam": "", "latinx": "", "metaverse": "", "neurodiverse": "", "nft": "", "onboarding": "", "open-source": "", "social": "", "web3": ""}}, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/palomaetienne.near/widget/New-Draft-0", "fact_widget_deployments_id": "e926d1a98e650776931bf32ba25da110", "inserted_timestamp": "2024-03-31T14:29:27.028Z", "modified_timestamp": "2024-03-31T14:29:27.028Z", "__row_index": 10}