{"tx_hash": "EWt1cqHRvRyFkdJtNMNSa28sSx1SWv1MaHMeGxMxhnG9", "action_id_social": "CV2mgyzmDdQSLmjT6bMVMhcCgui4xgKZnRJmfxHkSVUV-0-widget", "block_id": 102431807, "block_timestamp": "2023-10-02T07:07:20.602Z", "signer_id": "nearcon23.near", "widget_name": "Terms.Content.Section2", "source_code": "const ownerId = \"nearcon23.near\";\n\nconst C1 = styled.span`\n    font-weight: bold;\n`;\n\nconst Container = styled.div`\n    padding: 8px 16px;\n    margin-left: 16px;\n`;\n\nconst LI = styled.li`\n  list-style-type: none;\n  margin-top: 10px;\n`;\n\nreturn (\n  <Container>\n    <ol start=\"5\">\n      <li>\n        <C1>Marketing and Promotion</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            5.1. If you issue any press release or similar public announcement\n            in connection with the Event (including, without limitation, details\n            of the Event and the Terms), such press release or public\n            announcement shall comply with the content requirements set out in\n            Clause 3. &nbsp;\n          </span>\n        </LI>\n        <LI>\n          <span>\n            5.2. The Foundation may, but is not required to, make public your\n            participation in the Event and/or receipt of a Reward, including\n            (without limitation) for advertising or promotional purposes. Upon\n            request by the Foundation, you shall provide to the Foundation any\n            information or content reasonably requested by the Foundation for\n            inclusion in such publications. You may elect to no longer\n            participate in or publish contribution information by giving written\n            notice to the Foundation, in which case the Foundation will cease\n            use of your name and attribution information in new publicity, but\n            will not be required to recall or revise past press releases or\n            other materials.\n          </span>\n        </LI>\n      </ol>\n    </Container>\n    <ol start=\"6\">\n      <li>\n        <C1>Representations and Warranties</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            6.1. You represent and warrant that at all relevant times:{\" \"}\n          </span>\n        </LI>\n\n        <ol>\n          <LI>\n            <span>\n              6.1.1. you have authority to enter into the Terms, participate in\n              the Event and (if applicable) receive a Reward (including, without\n              limitation, that you are of legal age in your jurisdiction to\n              enter into the Terms and participate in the Event);{\" \"}\n            </span>\n          </LI>\n          <LI>\n            <span>\n              6.1.2. the information submitted to the Foundation in connection\n              with your participation in the Event is accurate, complete, true\n              and not misleading or deceptive; and\n            </span>\n          </LI>\n          <LI>\n            <span> 6.1.3. the Attendee Materials do not:</span>\n          </LI>\n        </ol>\n      </ol>\n      <Container>\n        <Container>\n          <ol>\n            <LI>\n              <span>\n                6.1.3.1. infringe upon, violate or misappropriate any right of\n                any third party (including, without limitation, any Intellectual\n                Property Right, right of privacy or publicity, or any other\n                proprietary right);\n              </span>\n            </LI>\n            <LI>\n              <span>\n                6.1.3.2. contain any illegal or defamatory materials or\n                otherwise violate the content standards set out in Clause 3; or\n              </span>\n            </LI>\n            <LI>\n              <span> 6.1.3.3. violate any law or regulation.</span>\n            </LI>\n          </ol>\n        </Container>\n      </Container>\n\n      <ol>\n        <LI>\n          <span>\n            6.2. THE FOUNDATION DOES NOT PROVIDE ANY WARRANTY OR REPRESENTATION\n            (WHETHER EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE) OF ANY\n            KIND IN RESPECT OF THE EVENT, NEAR, THE NEAR ECOSYSTEM, THE\n            FOUNDATION MATERIALS (WHICH ARE PROVIDED ON AS &ldquo;AS-IS&rdquo;\n            AND &ldquo;AS AVAILABLE&rdquo; BASIS), OR OTHERWISE UNDER OR IN\n            CONNECTION WITH THE TERMS OR THE EVENT.\n          </span>\n        </LI>\n      </ol>\n    </Container>\n\n    <ol start=\"7\">\n      <li>\n        <C1>&nbsp;Other</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            7.1. The Terms do not create an agent and principal or an employer\n            and employee partnership, joint venture, or any other relationship\n            except that of independent contractors between you and the\n            Foundation.{\" \"}\n          </span>\n        </LI>\n        <LI>\n          <span>\n            7.2. You are obliged, neither to offer directly or indirectly\n            advantages of any kind to third parties, nor to accept directly or\n            indirectly gifts or other advantages in connection with the Event,\n            which could be interpreted as bribery or as illegal practice.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            7.3. The Foundation makes no representation or warranty that you\n            shall profit in any way or derive any benefit from participating in\n            the Event.{\" \"}\n          </span>\n        </LI>\n      </ol>\n    </Container>\n\n    <ol start=\"8\">\n      <li id=\"h.1t3h5sf\">\n        <C1>Intellectual Property</C1>\n      </li>\n    </ol>\n\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            8.1. You grant to the Foundation and its Affiliates a non-exclusive,\n            worldwide, perpetual, royalty-free, irrevocable, sublicensable right\n            and license to use, reproduce, distribute, adapt, sell, create\n            derivative works from, display, record, live-stream, publish and/or\n            transmit your name, likeness, voice, image and/or the Attendee\n            Materials solely in connection with the Event and the\n            Foundation&rsquo;s and its Affiliates&rsquo; business including,\n            without limitation, for advertisement and promotion of NEAR events,\n            products and services, NEAR and/or the NEAR Ecosystem, in any media\n            formats, through any media channels or otherwise.{\" \"}\n          </span>\n        </LI>\n        <LI>\n          <span>\n            8.2. The Foundation grants to you a non-exclusive, worldwide,\n            royalty-free, non-sublicensable right and license to use the\n            Foundation Materials solely in connection with the Event.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            8.3. You acknowledge that the Foundation owns or has under license\n            all rights, title and interest in and to NEAR products and services,\n            the Foundation Materials, and the trademarks, trade names, logos,\n            designs, promotional materials, web pages, source codes, drawings,\n            illustrations, slogans and representations owned or used under\n            license by the Foundation, including (without limitation) all\n            associated Intellectual Property Rights.{\" \"}\n          </span>\n        </LI>\n        <LI>\n          <span>\n            8.4. You own all rights, title and interest in and to the Attendee\n            Materials, including all associated Intellectual Property Rights.\n          </span>\n          <C1>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</C1>\n        </LI>\n      </ol>\n    </Container>\n    <ol start=\"9\">\n      <li id=\"h.4d34og8\">\n        <C1>Confidentiality</C1>\n      </li>\n    </ol>\n    <Container>\n      <span>\n        At all times, during the term of the Event and thereafter, and to the\n        fullest extent permitted by law, you agree to hold all Confidential\n        Information in strict confidence, not to use it in any way, commercially\n        or otherwise, except for the purposes of the Event, and not to disclose\n        it to others. You also agree to take all actions reasonably necessary to\n        protect the confidentiality of all Confidential Information.{\" \"}\n      </span>\n    </Container>\n    <ol start=\"10\">\n      <li style={{ marginTop: 20, marginBottom: 20 }}>\n        <C1>Indemnification</C1>\n      </li>\n    </ol>\n    <Container>\n      <span>\n        YOU SHALL INDEMNIFY, DEFEND AND HOLD HARMLESS THE FOUNDATION (AND ITS\n        DIRECTORS, OFFICERS, EMPLOYEES, PARENT, AFFILIATES, SUBSIDIARIES AND\n        AGENTS) AGAINST ANY CLAIMS, ACTIONS PROCEEDINGS, LOSSES, DAMAGES,\n        EXPENSES AND COSTS (INCLUDING WITHOUT LIMITATION COURT COSTS AND\n        REASONABLE LEGAL FEES) ARISING OUT OF OR IN CONNECTION WITH YOUR\n        PARTICIPATION IN THE EVENT, INCLUDING (WITHOUT LIMITATION): ANY CLAIM\n        THAT THE Attendee MATERIALS INFRINGE THE INTELLECTUAL PROPERTY RIGHTS OF\n        ANY THIRD PARTY; ANY CLAIM BY A THIRD PARTY WHICH ARISES OUT OF OR IN\n        CONNECTION WITH ANYTHING THAT YOU DO, SAY, PROVIDE, SHARE, PUBLISH,\n        DELIVER AND/OR PRESENT IN CONNECTION WITH THE EVENT; OR ANY BREACH BY\n        YOU OF ANY PROVISION OF THE TERMS OR ANY EVENT RULES.{\" \"}\n      </span>\n    </Container>\n    <ol start=\"11\">\n      <li style={{ marginTop: 20, marginBottom: 20 }}>\n        <C1>Liability</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            11.1. NOTHING IN THIS AGREEMENT SHALL LIMIT OR EXCLUDE A PARTY&#39;S\n            LIABILITY:\n          </span>\n        </LI>\n      </ol>\n\n      <Container>\n        <ol>\n          <LI>\n            <span>\n              11.1.1. FOR DEATH OR PERSONAL INJURY CAUSED BY ITS NEGLIGENCE, OR\n              THE NEGLIGENCE OF ITS EMPLOYEES, AGENTS OR SUBCONTRACTORS;\n            </span>\n          </LI>\n          <LI>\n            <span>\n              {\" \"}\n              11.1.2. FOR FRAUD OR FRAUDULENT MISREPRESENTATION; OR&nbsp;\n            </span>\n          </LI>\n          <LI>\n            <span>\n              11.1.3. ANY OTHER LIABILITY WHICH CANNOT BE LIMITED OR EXCLUDED BY\n              APPLICABLE LAW.\n            </span>\n          </LI>\n        </ol>\n\n        <LI>\n          <span>\n            11.2. SUBJECT TO CLAUSE 11.1, YOU ACKNOWLEDGE AND AGREE THAT TO THE\n            EXTENT PERMISSIBLE BY LAW THE FOUNDATION SHALL HAVE NO LIABILITY TO\n            YOU OR ANYONE ELSE FOR ANY LIABILITY HOWSOEVER ARISING (WHETHER IN\n            TORT (INCLUDING FOR NEGLIGENCE) CONTRACT, MISREPRESENTATION (WHETHER\n            INNOCENT OR NEGLIGENT), RESTITUTION OR OTHERWISE) IN RESPECT OF:\n          </span>\n        </LI>\n\n        <Container>\n          <LI>\n            <span> 11.2.1. THE EVENT; </span>\n          </LI>\n          <LI>\n            <span>\n              11.2.2. ANY ACTION OR OMISSION BY THE FOUNDATION PURSUANT TO THE\n              TERMS OR IN CONNECTION WITH THE EVENT; AND\n            </span>\n          </LI>\n          <LI>\n            <span>\n              11.2.3. ANY ACTION, OMISSION, ACTIVITY CONDUCTED, AND/OR REWARD\n              PROVIDED, BY ANY THIRD PARTY (INCLUDING, WITHOUT LIMITATION, ANY\n              THIRD PARTY THAT THE FOUNDATION IS CONDUCTING THE EVENT JOINTLY\n              WITH) IN CONNECTION WITH THE EVENT (IN RESPECT OF WHICH YOU\n              ACKNOWLEDGE THAT THE FOUNDATION HAS NO RESPONSIBILITY AND THAT YOU\n              SHALL REFER TO ANY APPLICABLE TERMS, CONDITIONS AND/OR RULES THAT\n              MAY BE IMPOSED BY SUCH PARTY).\n            </span>\n          </LI>\n        </Container>\n\n        <LI>\n          <span>\n            11.3. YOUR LIABILITY UNDER THE TERMS IS UNRESTRICTED TO THE EXTENT\n            PERMISSIBLE BY LAW.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            11.4. The Foundation is not liable for transmission errors resulting\n            in omission, interruption, deletion, defect, delay in operations or\n            transmission, theft or destruction or unauthorized access to or\n            alterations of any Attendee Materials, any Foundation Materials, any\n            others materials in connection with the Event or the Terms, or for\n            technical, network, telephone equipment, electronic, computer,\n            hardware or software malfunctions or limitations of any kind, or\n            inaccurate transmissions of or failure to receive entry information\n            by the Foundation on account of technical problems or traffic\n            congestion on the internet or at any website or any combination\n            thereof. The Foundation is also not liable for injury or damage to\n            your computer or any others resulting from downloading any materials\n            in connection with the Event.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            11.5. THE EXCLUSIONS AND LIMITATIONS OF LIABILITY SET FORTH IN THIS\n            CLAUSE 11 ARE FUNDAMENTAL ELEMENTS OF THE BASIS OF YOUR\n            PARTICIPATION IN THE EVENT.{\" \"}\n          </span>\n        </LI>\n      </Container>\n    </Container>\n    <p style={{ marginTop: 20, marginBottom: 20 }}>\n      <ol start=\"12\">\n        <li>\n          <C1>Termination</C1>\n        </li>\n      </ol>\n      <ol>\n        <LI>\n          <span>\n            12.1. The term of the Terms commences on the date you begin the\n            Event and continues until the earlier of: (i) the end of the Event\n            or (ii) termination by the Foundation pursuant to Clause 12.2 or\n            14.2.{\" \"}\n          </span>\n        </LI>\n        <LI>\n          <span>\n            12.2. The Foundation may, without any liability, terminate the Terms\n            and/or the Event (in whole or in part) at any time with immediate\n            effect by written notice to you.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            12.3. Upon any termination, discontinuation or cancellation of the\n            Terms all provisions of the Terms which by their nature should\n            survive will survive, including, without limitation: Clause 1\n            (Definitions), Clause 4 (Rewards), Clause 5 (Marketing and\n            Promotion), Clause 6 (Other), Clause 8 (Intellectual Property),\n            Clause 9 (Confidentiality), Clause 10 (Indemnification), Clause 11\n            (Liability), Clause 14 (General Conditions) and Clause 15 (Governing\n            Law and Jurisdiction).\n          </span>\n        </LI>\n      </ol>\n      <ol start=\"13\">\n        <li>\n          <C1>Personal Information</C1>\n        </li>\n      </ol>\n\n      <Container>\n        The personal information submitted by you in connection with your\n        application to join the Event and what you provide to us in connection\n        with your participation in the Event will be used for the purposes\n        described in the Terms and will otherwise be handled in accordance with\n        the Privacy Policy, and you acknowledge and agree to such use.\n      </Container>\n    </p>\n  </Container>\n);\n", "metadata": {"platform": "jutsu.ai"}, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/nearcon23.near/widget/Terms.Content.Section2", "fact_widget_deployments_id": "cee0ab2c581fecfb2aa229344531b187", "inserted_timestamp": "2024-03-07T05:24:05.087Z", "modified_timestamp": "2024-03-07T05:24:05.087Z", "__row_index": 0}