{"tx_hash": "BQnaSkjZKbJz3R17HDqj12LRWQKP3Bvwwffmj4bSjvBD", "action_id_social": "8yDtT5WfDsn1FWrUeymjP9txG1F9Zf8DLsLVC6zg7Kiz-0-widget", "block_id": 116757458, "block_timestamp": "2024-04-13T12:54:47.615Z", "signer_id": "v1.wireframes.near", "widget_name": "Components.Card.CardDetail.TransactionCardDetail", "source_code": "/* -------------------------------------------------------------------------- */\n/*\n __        ___           __                               \n \\ \\      / (_)_ __ ___ / _|_ __ __ _ _ __ ___   ___  ___ \n  \\ \\ /\\ / /| | '__/ _ \\ |_| '__/ _` | '_ ` _ \\ / _ \\/ __|\n   \\ V  V / | | | |  __/  _| | | (_| | | | | | |  __/\\__ \\\n    \\_/\\_/  |_|_|  \\___|_| |_|  \\__,_|_| |_| |_|\\___||___/\n\n  =========================================================\n  * Wireframes - v1.0.0\n  =========================================================\n  * Product Page: https://wireframes.design\n  =========================================================\n  * The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\n                                                                                 */\n/* -------------------------------------------------------------------------- */\n\nconst cardsProps = {\n  isSend: true,\n  amount: 100,\n  accountId: \"wireframes\",\n  currency: \"ETH\",\n};\n\nconst detail = `\nconst cardsProps = {\n  isSend: true,\n  amount: 100,\n  accountId: \"wireframes\",\n  currency: \"ETH\",\n};\nreturn(\n<Widget src=\"v1.wireframes.near/widget/Components.Card.TransactionCard\" props={cardsProps} />\n);`;\n\nconst explanation =\n  \"A transaction card is a user interface component commonly used in financial applications, e-commerce platforms, and other systems where users perform transactions. It provides a concise summary of a specific transaction, displaying key details such as the transaction amount, date, description, and any related information.\";\n\nconst propsExplanation = [\n  {\n    title: \"receiveIconName\",\n    content:\n      \"You can use receiveIconName to dynamically determine which icon to display based on certain conditions. e.g.\",\n    code: `const cardsProps = {\n      receiveIconName: 'arrow-down-left',\n    };`,\n  },\n  {\n    title: \"receiveIconSize\",\n    content:\n      \"You can use the props receiveIconSize typically refers to the dimensions or size of an icon in a user interface. e.g.\",\n    code: `const cardsProps = { \n      receiveIconSize: '20px',\n    };`,\n  },\n  {\n    title: \"receiveIconColor\",\n    content:\n      \"You can use the props receiveIconColor is commonly used to specify the color of an icon in a user interface. It allows developers to control the visual appearance of icons by setting their color to match the design. e.g.\",\n    code: `const cardsProps = {\n      receiveIconColor: '#30c730',\n    };`,\n  },\n  {\n    title: \"sendIconName\",\n    content:\n      \"You can use sendIconName to dynamically determine which icon to display based on certain conditions. e.g.\",\n    code: `const cardsProps = {\n      sendIconName: 'arrow-up-right',\n    };`,\n  },\n  {\n    title: \"sendIconSize\",\n    content:\n      \"You can use the props sendIconSize typically refers to the dimensions or size of an icon in a user interface. e.g.\",\n    code: `const cardsProps = { \n      sendIconSize: '20px',\n    };`,\n  },\n  {\n    title: \"sendIconColor\",\n    content:\n      \"You can use the props sendIconColor is commonly used to specify the color of an icon in a user interface. It allows developers to control the visual appearance of icons by setting their color to match the design. e.g.\",\n    code: `const cardsProps = {\n      sendIconColor: '#e9050d',\n    };`,\n  },\n  {\n    title: \"isSend\",\n    content:\n      \"The 'isSend: true' props is likely used as a boolean indicator to signify that an amount, action or operation is in the process of sending data or information from the client to another destination. e.g.\",\n    code: `const cardsProps = {\n      isSend: true,\n    };`,\n  },\n  {\n    title: \"amount\",\n    content:\n      \"The term 'amount' typically refers to a numerical value that represents a quantity of amount or something, often in the context of financial transactions or measurements. e.g.\",\n    code: `const cardsProps = {\n      amount: 100,\n    };`,\n  },\n  {\n    title: \"accountId\",\n    content:\n      \"The term 'accountId' typically refers to a unique identifier associated with a specific account in a system or platform. e.g.\",\n    code: `const cardsProps = {\n      accountId: 'wireframe',\n    };`,\n  },\n  {\n    title: \"currency\",\n    content:\n      \"The term 'currency' refers to a system of money that is used in a particular country or region for transactions, trade, and commerce. e.g.\",\n    code: `const cardsProps = {\n      currency: 'ETH',\n    };`,\n  },\n  {\n    title: \"style\",\n    content:\n      \"You can use the style attribute to apply styles to components. e.g.\",\n    code: `const cardsProps = {\n      style:{ \n        cardWidth: '100%',\n        cardPadding: '15px 10px 0px',\n      }, \n    };`,\n    children: [\n      {\n        title: \"cardWidth\",\n        content:\n          \"The property cardWidth likely refers to the width of a card component in a user interface. This property is used to specify the horizontal dimension of the card, determining how wide it appears on the screen. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardWidth: '100%',\n          }, \n        };`,\n      },\n      {\n        title: \"cardDisplay\",\n        content:\n          \"The property cardDisplay likely refers to how card components are displayed. It used to control the layout or arrangement of card elements on the screen. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"cardPadding\",\n        content:\n          \"The property cardPadding refers to the padding applied to the content area of a card component. Padding is the space between the content of an element and its border. Setting cardPadding allows for control over the amount of space between the content and the edges of the card. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardPadding: '15px 10px 0px',\n          }, \n        };`,\n      },\n      {\n        title: \"cardAlignItems\",\n        content:\n          \"The property cardAlignItems likely refers to how the items inside a card component are aligned along the cross-axis. This property is typically used in conjunction with a flexbox or grid layout to control the vertical alignment of elements within the card. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardAlignItems: 'center',\n          }, \n        };`,\n      },\n      {\n        title: \"cardBorder\",\n        content:\n          \"The property cardBorder likely refers to the border style applied to a card component. Borders are used to visually separate elements and provide a visual distinction between them. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardBorder: '1px solid #00000012',\n          }, \n        };`,\n      },\n      {\n        title: \"cardBorderRadius\",\n        content:\n          \"The property cardBorderRadius is likely used to specify the radius of the rounded corners of a card component. Rounded corners can enhance the visual appeal of elements and soften their appearance. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardBorderRadius: '0px',\n          }, \n        };`,\n      },\n      {\n        title: \"cardJustifyContent\",\n        content:\n          \"The property cardJustifyContent is likely used to control the horizontal alignment of items within a card component. It's commonly used in conjunction with flexbox layout to distribute space between and around items along the main axis of the card. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardJustifyContent: 'space-between',\n          }, \n        };`,\n      },\n      {\n        title: \"cardBorderBottomWidth\",\n        content:\n          \"The property cardBorderBottomWidth likely refers to the width of the bottom border of a card component. This property allows developers to specify the thickness of the border line along the bottom edge of the card. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardBorderBottomWidth: '1px',\n          }, \n        };`,\n      },\n      {\n        title: \"cardBackgroundColor\",\n        content:\n          \"You can use color names, hex codes, or RGB values to change background color of the card. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            cardBackgroundColor: '#ececec',\n          }, \n        };`,\n      },\n      {\n        title: \"bodyWidth\",\n        content:\n          \"The property bodyWidth likely refers to the width of the body content or main content area in a web page or application. It is used to control the width of the content displayed to the user. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            bodyWidth: '80%',\n          }, \n        };`,\n      },\n      {\n        title: \"bodyDisplay\",\n        content:\n          \"The property bodyDisplay is likely used to control the display behavior of the body element. It specifies how the body content is rendered in the browser window. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            bodyDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"bodyGap\",\n        content:\n          \"The property bodyGap is used to specify the gap or spacing between elements within the body of a web page or application. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            bodyGap: '10px',\n          }, \n        };`,\n      },\n      {\n        title: \"imageWidth\",\n        content:\n          \"The property imageWidth likely refers to the width of an image element. It's used to specify the width of the image displayed on a web page or application. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            imageWidth: '40px',\n          }, \n        };`,\n      },\n      {\n        title: \"imageHeight\",\n        content:\n          \"The property imageHeight likely refers to the height of an image element. It's used to specify the height of the image. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            imageHeight: '40px',\n          }, \n        };`,\n      },\n      {\n        title: \"imageObjectFit\",\n        content:\n          \"The property imageObjectFit is likely used to specify how an image should be resized to fit its container while preserving its aspect ratio. It's a CSS property that determines how an image should be scaled and positioned within its containing element. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            imageObjectFit: 'contain',\n          }, \n        };`,\n      },\n      {\n        title: \"imageBorderRadius\",\n        content:\n          \"The property imageBorderRadius is likely used to specify the radius of the rounded corners of an image element. It allows developers to apply rounded corners to images, enhancing their visual appearance and integrating them better. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            imageBorderRadius: '100%',\n          }, \n        };`,\n      },\n      {\n        title: \"titleWidth\",\n        content:\n          \"The property titleWidth is used to specify the width of a title element, such as a heading or a text block. This property would allow developers to control the width of titles, ensuring consistent alignment and layout. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            titleWidth: '100%',\n          }, \n        };`,\n      },\n      {\n        title: \"titleMinWidth\",\n        content:\n          \"The property titleMinWidth would likely be used to specify the minimum width of a title element, such as a heading or text block. It allows developers to ensure that the title element maintains a certain minimum width, preventing it from becoming too narrow and potentially affecting readability or layout. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            titleMinWidth: '160px',\n          }, \n        };`,\n      },\n      {\n        title: \"titleFontWeight\",\n        content:\n          \"The property titleFontWeight would likely be used to specify the weight, or thickness, of the font used in a title element, such as a heading or text block. It allows developers to control the visual weight of the text, influencing its prominence and emphasis within the layout. e.g.\",\n        code: `const cardsProps = {\n          style:{ \n            titleFontWeight: '600',\n          }, \n        };`,\n      },\n      {\n        title: \"titleFontColor\",\n        content:\n          \"The property titleFontColor would likely be used to specify the color of the text in a title element, such as a heading or text block. It allows developers to control the visual appearance of the text. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            titleFontColor: '#000',\n          }, \n        };`,\n      },\n      {\n        title: \"titleFontFamily\",\n        content:\n          \"The property titleFontFamily would likely be used to specify the font family for text in a title element, such as a heading or text block. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            titleFontFamily: 'Mona Sans',\n          }, \n        };`,\n      },\n      {\n        title: \"titleFontSize\",\n        content:\n          \"The property titleFontSize would likely be used to specify the size of the text in a title element, such as a heading or text block. It allows developers to control the visual size of titles, ensuring they are appropriately sized for readability and aesthetics. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            titleFontSize: '16px',\n          }, \n        };`,\n      },\n      {\n        title: \"titleMargin\",\n        content:\n          \"The property titleMargin would likely be used to specify the margins around a title element, such as a heading or text block. It allows developers to control the spacing between the title element and surrounding content, helping to create visually balanced layouts. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            titleMargin: '0px 5px 0px 0px',\n          }, \n        };`,\n      },\n      {\n        title: \"titleWordBreak\",\n        content:\n          \"The property titleWordBreak would likely be used to specify how words should break or wrap within a title element, such as a heading or text block. It allows developers to control how long words are handled when they exceed the width of their container. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            titleWordBreak: 'break-all',\n          }, \n        };`,\n      },\n      {\n        title: \"containerWidth\",\n        content:\n          \"The property containerWidth would likely be used to specify the width of a container element, such as a <div> or a section. It allows developers to control the size of the container, influencing the layout of its contents within a webpage or application. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            containerWidth: 'fit-content',\n          }, \n        };`,\n      },\n      {\n        title: \"containerDisplay\",\n        content:\n          \"The containerDisplay property would likely be used to specify the CSS display property for a container element, such as a <div> or a section. The display property determines how an element is rendered in the document layout. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            containerDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"containerJustifyContent\",\n        content:\n          \"The property containerJustifyContent would likely be used to specify justify-content property for a container element, such as a <div> or a section. This property property is used in flexbox layouts to align flex items along the main axis of the container. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            containerJustifyContent: 'end',\n          }, \n        };`,\n      },\n      {\n        title: \"contentFontSize\",\n        content:\n          \"The property contentFontSize is used to specify the font size for text content within a container element, such as a <div> or a section. You can use the props to customize the font size. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            contentFontSize: '28px',\n          }, \n        };`,\n      },\n      {\n        title: \"contentDisplay\",\n        content:\n          \"The property contentDisplay is used to specify the display property for content elements within a container element, such as a <div> or a section. The display property determines how an element is rendered in the document layout. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            contentDisplay: 'flex',\n          }, \n        };`,\n      },\n      {\n        title: \"contentAlignItems\",\n        content:\n          \"The property contentAlignItems is used to specify the align-items property for content elements within a container element, such as a <div> or a section. The align-items property is used in flexbox layouts to align content items along the cross axis of the container. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            contentAlignItems: 'end',\n          }, \n        };`,\n      },\n      {\n        title: \"contentFontColor\",\n        content:\n          \"The property contentFontColor is used to specify the color of the text content within a container element, such as a <div> or a section. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            contentFontColor: '#000',\n          }, \n        };`,\n      },\n      {\n        title: \"spanFontSize\",\n        content:\n          \"The property spanFontSize is used to specify the font size of <span> elements within a container or a specific context. It allows developers to control the size of text within <span> elements, providing finer-grained control over text styling. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            spanFontSize: '20px',\n          }, \n        };`,\n      },\n      {\n        title: \"spanFontWeight\",\n        content:\n          \"The property spanFontWeight is used to specify the font weight of <span> elements within a container or a specific context. It allows developers to control the thickness of text within <span> elements, providing finer-grained control over text styling. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            spanFontWeight: '400',\n          }, \n        };`,\n      },\n      {\n        title: \"spanFontColor\",\n        content:\n          \"The property spanFontColor is used to specify the color of text within <span> elements, providing finer-grained control over text styling within a container or a specific context. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            spanFontColor: '#A1A09A',\n          }, \n        };`,\n      },\n      {\n        title: \"spanMarginBottom\",\n        content:\n          \"The property spanMarginBottom is used to specify the bottom margin for <span> elements within a container or a specific context. It allows developers to control the spacing between <span> elements and other elements around them. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            spanMarginBottom: '4px',\n          }, \n        };`,\n      },\n      {\n        title: \"spanMarginLeft\",\n        content:\n          \"The property spanMarginLeft is used to specify the left margin for <span> elements within a container or a specific context. It allows developers to control the spacing between <span> elements and other elements around them. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            spanMarginLeft: '2px',\n          }, \n        };`,\n      },\n      {\n        title: \"iconBoxPadding\",\n        content:\n          \"The property iconBoxPadding is used to specify the padding around an icon within an icon box or container. It allows developers to control the spacing between the icon and the edges of its containing element. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            iconBoxPadding: '10px',\n          }, \n        };`,\n      },\n      {\n        title: \"iconBoxMarginBottom\",\n        content:\n          \"The property iconBoxMarginBottom is used to specify the bottom margin for an icon box or container. It allows developers to control the spacing between icon boxes and other elements below them. e.g.\",\n        code: `const cardsProps = {\n          style:{   \n            iconBoxMarginBottom: '1px',\n          }, \n        };`,\n      },\n    ],\n  },\n  {\n    title: \"cardHeader\",\n    content:\n      \"The cardHeader props refers to the top section of a card component. You can pass the code to set the card header. e.g.\",\n    code: `const cardsProps = { \n      cardHeader: (\n        <>\n          <h1>Card Header</h1>\n        </>\n      ),\n    };`,\n  },\n  {\n    title: \"cardHeaderStyle\",\n    content:\n      \"The cardHeaderStyle props refers to the top section of a card component. You can customize the card by using this prop. e.g.\",\n    code: `const cardsProps = { \n      cardHeaderStyle: {\n        color: \"white\",\n      },\n    };`,\n  },\n  {\n    title: \"cardBody\",\n    required: \"true\",\n    content:\n      \"The cardBody props is used to define the main content area of a card component. You can pass the code to set the card body. e.g.\",\n    code: `const cardsProps = { \n      cardBody: (\n        <>\n          <h1>Card Body Sample Text</h1>\n        </>\n      ),\n    };`,\n  },\n  {\n    title: \"cardBodyStyle\",\n    content:\n      \"The cardBodyStyle props refers to the main content area of a card component. You can customize the card body by using this prop. e.g.\",\n    code: `const cardsProps = { \n      cardBodyStyle: {\n        color: \"white\",\n      },\n    };`,\n  },\n];\n\nconst props = {\n  copyBtn: detail,\n  component: (\n    <div className=\"row\">\n      <div className=\"p-2\">\n        <Widget\n          src=\"v1.wireframes.near/widget/Components.Card.TransactionCard\"\n          props={cardsProps}\n        />\n      </div>\n    </div>\n  ),\n  text: detail,\n  explanation: explanation,\n  propsExplanation: propsExplanation,\n};\n\nreturn (\n  <>\n    <Widget\n      src={`v1.wireframes.near/widget/Components.Learning.LearningCard`}\n      props={props}\n    />\n  </>\n);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/v1.wireframes.near/widget/Components.Card.CardDetail.TransactionCardDetail", "fact_widget_deployments_id": "57cf02805e60849c99332625960b7dd3", "inserted_timestamp": "2024-04-13T14:37:28.463Z", "modified_timestamp": "2024-04-13T14:37:28.463Z", "__row_index": 0}