{"tx_hash": "BhHTgjoBXfQyijnXS8Hf1sP16ZL3KCEfX7Wqp1sMd7fX", "action_id_social": "4pgvas4yaMdTNGckkbDixmQtFwcjUVfZuwkDKu2m3niq-0-widget", "block_id": 114835923, "block_timestamp": "2024-03-16T16:28:01.778Z", "signer_id": "hack.near", "widget_name": "AgreementPage", "source_code": "const Container = styled.div`\n  background-color: #fff;\n`;\n\nreturn (\n  <Container class=\"c12 c20 doc-content\">\n    <p class=\"c13 title\">\n      <h1 class=\"c23\">Member Agreement</h1>\n      <h3 class=\"c23\">NEAR Builders Cooperative</h3>\n      <h5>\n        🚧 <a href=\"https://nearbuilders.org\">nearbuilders.org</a> 🚧\n      </h5>\n    </p>\n    <hr />\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c19\">\n      <span class=\"c0\">\n        <i>\n          <b>Last updated:</b> October 2023\n        </i>\n      </span>\n    </p>\n    <p class=\"c3\">\n      <span class=\"c0\"></span>\n    </p>\n    <p class=\"c19\">\n      <span>\n        This Member Agreement (“Agreement”) is made effective (“Effective Date”)\n        on the date that you (referred to as “you”, “your” or “Member”) executed\n        it. It provides for your rights and obligations to NEAR Builders\n        Cooperative, a Colorado limited cooperative association (the\n        “Cooperative”).\n      </span>\n    </p>\n    <h5 class=\"c5\">\n      <span class=\"c0\">\n        <b>1. PURPOSE AND STRUCTURE OF THE COOPERATIVE</b>\n      </span>\n    </h5>\n    <p class=\"c6\">\n      <span class=\"c0\">High level explanation of:</span>\n    </p>\n    <ul class=\"c6\">\n      <li class=\"c0\">\n        <b>Purpose:</b> NEAR Builders Cooperative connects developer communities\n        around the world to share knowledge, coordinate programs, and learn\n        together. Members organize various initiatives focused on development,\n        education, and onboarding. The goal is to create a positive impact\n        everywhere by increasing accessibility of blockchain technology,\n        enhancing the quality of experience for builders, and cultivating\n        successful open web applications.\n      </li>\n      <li>\n        <b>Structure as an LCA</b>, which is owned by its members, managed by\n        Admins, and with a Council that oversees the financial obligations of\n        the Cooperative.\n      </li>\n      <li>\n        Financially, the Cooperative is not intended to generate profit for\n        itself, but to benefit its members and the community, by the pulled\n        power of the members’ contributions.\n      </li>\n      <li>Democratic governance with decentralized decision making.</li>\n    </ul>\n    <h5 class=\"c5\">\n      <span class=\"c0\">\n        <b>2. STATEMENT OF BACKGROUND INFORMATION</b>\n      </span>\n    </h5>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        This document is intended to guide the relationship between the Member\n        and the Cooperative in their shared purpose of improving their\n        businesses through the Cooperative services.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        Once this Agreement is executed by both parties, you will be accepted by\n        the board of directors of the Cooperative (“Council”) to become a Member\n        of the Cooperative, as defined in the Articles of Organization filed\n        with the Secretary of State of Colorado, as amended from time to time\n        (“Articles”), Bylaws of the Cooperative, as amended from time to time\n        (“Bylaws”), and the Charter. You are encouraged to become familiar with\n        these documents; they are incorporated in this Agreement by reference.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        As a Member, you will be issued one membership interest subject to the\n        terms and conditions, rights and obligations contained in the Articles\n        of Organization, the Bylaws of the Cooperative, the Charter, and this\n        Agreement.\n      </span>\n    </p>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        When accessing specific services via the Platform, other terms and\n        conditions may apply (&ldquo;Third Party Terms&rdquo;) and you are\n        solely responsible for reviewing, understanding and adhering to those\n        Third Party Terms.\n      </span>\n    </p>\n    <h5 class=\"c5\">\n      <span class=\"c0\">\n        <b>3. AGREEMENTS OF THE MEMBER</b>\n      </span>\n    </h5>\n    <p class=\"c6\">\n      <span class=\"c0\">By becoming a Member, you agree to:</span>\n    </p>\n    <ul class=\"c6\">\n      <li class=\"c0\">\n        Help the Cooperative to fulfill its purpose, and to abide by the values\n        adopted by the Cooperative and its Members.\n      </li>\n      <li>\n        Pay for membership as set in the Bylaws, if a membership fee is\n        required, and periodically updated by the Council.\n      </li>\n      <li>\n        Participate in Cooperative governance functions and responsibilities\n        (like voting and engaging with working groups), patronize the\n        Cooperative, and remain in good standing as a member. Patronizing the\n        Cooperative means you will provide a number of at least eight hours of\n        contribution to the Cooperative, by collaborating with projects,\n        participating in decisions about the membership class, certain\n        governance decisions, as provided for in the Bylaws of the Cooperative,\n        and other decisions put to a vote of the members, including concerning\n        retroactive compensation. The Cooperative may adopt other policies\n        specifying the activities that are considered patronage and you will\n        receive notice of those before being obligated to engage in such\n        activities.\n      </li>\n      <li>\n        Agree to be bound by Cooperative’s Bylaws and the Articles, the Charter\n        and other policies of the Cooperative, and you are aware that you can\n        request a copy of the Bylaws.\n      </li>\n      <li>\n        Agree to keep all financial and proprietary information about the\n        Cooperative or its Members private and confidential, and not to use it\n        without permission even after termination of your membership.\n      </li>\n    </ul>\n    <p class=\"c1\">\n      <span class=\"c0\">\n        The Cooperative intends to operate equitably, creating opportunities for\n        the members to receive equitable distributions of benefits, and to\n        participate in decentralized decision-making. As part of this process,\n        we believe that we must reach a number of understandings, described\n        below:\n      </span>\n    </p>\n    <ul class=\"c6\">\n      <li class=\"c0\">\n        Understand that your membership is not transferable – so you cannot\n        transfer it to another person, but the Cooperative may agree to buy it\n        back from you. Your membership is also redeemable, which means that you\n        are entitled to reimbursement of the membership fee that you paid, if\n        any was paid, should you decide to no longer be a member in the\n        Cooperative.\n      </li>\n      <li>\n        Understand that the benefits of your membership can be modified by the\n        Council and management of the Cooperative at any time, without prior\n        notice; however, the Council may not eliminate your financial rights and\n        terminate your membership if you are a member in good standing. In case\n        of changes to your benefits, the Cooperative will make such information\n        available through its website, app, or another technology that gives you\n        proper notice, and you accept the use of the Cooperative’s technology\n        for these purposes. Future potential financial distributions related to\n        your Cooperative membership cannot be taken away by the Council.\n      </li>\n      <li>\n        Understand that the Cooperative will engage in fair and decentralized\n        decision making, which means you will always have an opportunity to\n        share your perspective, feedback, and advice for decisions which impact\n        you. Additionally, the Cooperative will make major decisions, which\n        impact most members, through a combination of proposals and off and\n        on-chain voting, and the Member has the responsibility to work with the\n        proposers to improve the proposals.\n      </li>\n      <li>\n        Understand that the Cooperative will engage in fast and fair conflict\n        resolution, as provided by the policies of the Cooperative and the\n        Charter to find resolution.\n      </li>\n      <li>\n        Understand that in case of dissolution of the Cooperative, or other\n        occasion for extraordinary dividends to be paid to Cooperative members,\n        you may be entitled to some financial distributions that could result in\n        a taxable event that you have a responsibility to claim on your tax\n        returns.\n      </li>\n      <li>\n        Understand that, as a Cooperative Member, you have no authority to\n        represent the Cooperative in any way. For example, you cannot use the\n        name of the Cooperative to obtain credit, or enter into contracts on\n        behalf of the Cooperative.\n      </li>\n      <li>\n        Understand that the Cooperative may put a lien on your membership to\n        satisfy your financial obligations to the Cooperative; however, you may\n        not require that the Cooperative offset any debts or claims that you owe\n        to the Cooperative against any amounts that the Cooperative may owe to\n        you.\n      </li>\n      <li>\n        Understand that the Council and its representatives and the Admins have\n        the authority to enforce the terms of this Agreement.\n      </li>\n      <li>\n        Understand that the Cooperative’s Council or a vote of the Members may\n        result in your termination if you fail to fulfil your obligations to the\n        Cooperative. You acknowledge that you have access to the Bylaws\n        describing the situations where this may happen and the procedure to be\n        followed.\n      </li>\n    </ul>\n    <h5 class=\"c5\">\n      <span class=\"c0\">\n        <b>4. INAPPLICABILITY OF THE AGREEMENT TO CERTAIN SITUATIONS</b>\n      </span>\n    </h5>\n    <p class=\"c1\">\n      <span>\n        This Agreement does not apply in the event of a merger, consolidation,\n        sale of assets, or dissolution of the Cooperative. In these cases, the\n        provisions of the Bylaws will apply.\n      </span>\n    </p>\n    <h5 class=\"c5\">\n      <span class=\"c0\">\n        <b>5. MISCELLANEOUS</b>\n      </span>\n    </h5>\n    <ul class=\"c6\">\n      <li class=\"c0\">\n        <b>Indemnification.</b> The Member agrees to indemnify, defend, and hold\n        harmless the Cooperative, its directors, officers, employees, and\n        agents, and their respective successors and assigns, from and against\n        any and all damages, liabilities, losses, costs, expenses, obligations,\n        claims, suits, judgments, settlements, and demands (including reasonable\n        attorneys' fees and costs), incurred or suffered by the Cooperative as a\n        result of or arising from: (a) any breach of this Agreement by the\n        Member, including any representation or warranty made by the Member\n        herein; (b) any act or omission by the Member in connection with the\n        Member's participation in the Cooperative; (c) any negligence or wilful\n        misconduct by the Member, or its officers, employees, agents,\n        affiliates, or representatives, in connection with the Member's\n        performance under this Agreement; or (d) any violation of any law or\n        regulation by the Member. The Member's obligations under this section\n        shall survive any termination or expiration of this Agreement.\n      </li>\n      <li>\n        <b>Limitation of Liability.</b> The Cooperative is not responsible for\n        any losses or damages that happen because of the Member's membership and\n        the Member’s use of information that is beyond the Cooperative's\n        control. The Cooperative is not liable for any damages that arise from\n        the Member's membership, their use of the Cooperative's services, or\n        third-party services, or their Affiliated Parties, or the Member’s\n        engagement with the Cooperative ecosystem. The Cooperative's total\n        liability to the Member is limited to the membership price, if one was\n        required, plus any patronage dividends that were declared but not yet\n        paid to the Member at the time of the claim of liability. If none was\n        declared, then the total liability is limited to $100 USD or the\n        equivalent in stablecoin of the country where the member is based.\n      </li>\n      <li>\n        <b>Specific Enforcement.</b> If either party violates this agreement,\n        the other party can ask a court to stop them (an injunctive relief).\n        This is in addition to other legal remedies. Both parties agree that\n        paying money may not be enough to address the claim.\n      </li>\n      <li>\n        <b>Additional Documentation Required.</b> All parties must sign any\n        additional documents that the Cooperative decides that are necessary to\n        fulfil this Agreement and the Member’s obligations to the Cooperative.\n      </li>\n      <li>\n        <b>Term and Termination.</b> This Agreement lasts for as long as the\n        Member is a Member in the Cooperative; and termination of the Member is\n        regulated by the Bylaws.\n      </li>\n      <li>\n        <b>Entire Agreement:</b> This Agreement contains all of the details of\n        the parties' agreement and supersedes any previous negotiations or\n        agreements, written or oral, about the matters in this document. This\n        Agreement can only be changed in writing by the Cooperative and all\n        Members. If any part of this Agreement is illegal or unenforceable, it\n        won't affect the rest of the Agreement. Both parties intend this\n        Agreement to be binding and to bind their heirs, legal representatives,\n        successors, and assigns, for as long as there is a membership\n        relationship between them.\n      </li>\n      <li>\n        The laws of the State of Colorado will govern this Agreement, and the\n        parties agree that the venue for enforcement of this Agreement will be\n        in the U.S. jurisdiction against whom any claims are brought under this\n        Agreement.\n      </li>\n      <li>\n        You and the Cooperative agree that, in the event that (i) a dispute\n        arises between you and the Cooperative concerning this Membership\n        Agreement, and any other agreements between you and the Cooperative, and\n        (ii) if we are unable to resolve the dispute through discussion, we\n        agree to submit that dispute to mediation and the dispute resolution\n        mechanism indicated in the Charter and other policies of the\n        Cooperative, before the dispute is arbitrated or taken to court. In any\n        event, you agree to and by signing this Agreement you do WAIVE ANY RIGHT\n        TO A JURY.\n      </li>\n    </ul>\n    <br />\n    <h3 class=\"c4\">\n      <span class=\"c7\">Feedback Welcome</span>\n    </h3>\n    <hr />\n    <p class=\"c1\">\n      <span>\n        All comments, questions, and other communications regarding this\n        Agreement should be directed to:{\" \"}\n      </span>\n      <span class=\"c22\">\n        <a href=\"mailto:support@nearbuilders.org\">support@nearbuilders.org</a>\n      </span>\n    </p>\n    <br />\n  </Container>\n);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/hack.near/widget/AgreementPage", "fact_widget_deployments_id": "a4aec22c690565c979d31b33cc293f92", "inserted_timestamp": "2024-03-16T17:25:58.846Z", "modified_timestamp": "2024-03-16T17:25:58.846Z", "__row_index": 5}