{"tx_hash": "DNTRufK5S22MgEGWjTHUtbUwPZfcwd6f3NS4TggaQ2id", "action_id_social": "6R6SU9mGSu7Dimg2y3MmxAxNU6sg3U1d8GpJc2Tk3Hfv-0-widget", "block_id": 115112394, "block_timestamp": "2024-03-20T18:10:06.854Z", "signer_id": "identity.near", "widget_name": "faq", "source_code": "const questions = props.questions || [\n  {\n    question: \"What does KYC mean?\",\n    answer:\n      \"KYC (Know-Your-Customer) is a standard verification process used by a variety of companies to verify the identity of the people they interact and/or transact with. Similarly, KYB (Know-Your-Business) is a verification process used to verify the legitimacy of organizations and their shareholders/authorized representatives.\",\n  },\n  {\n    question: \"Why is KYC required?\",\n    answer:\n      \"Following KYC procedures is crucial for companies to ensure compliance with local and global AML (Anti-Money Laundering) requirements are met.\",\n  },\n  {\n    question: \"What does KYC accomplish?\",\n    answer:\n      \"Issuing regular KYC checks maintains financial transparency and safety by preventing companies from engaging in potential criminal activity with a counterparty.\",\n  },\n  {\n    question: \"When should I complete KYC?\",\n    answer:\n      \"If you are planning to receive a payment from the NDC you will need to submit a KYC profile and receive an approval of that profile.\",\n  },\n  {\n    question: \"How do I complete KYC?\",\n    answer:\n      \"Visit kyc.near.org and choose the appropriate verification journey. Individuals select the KYC option and organizations select the KYB option.\",\n  },\n  {\n    question: \"How long does KYC take to complete?\",\n    answer:\n      \"Completing the KYC profile should take up to 15 minutes, but it may take longer if you do not have easy access to the requested information.\",\n  },\n  {\n    question: \"How long does it take for the KYC profile to be approved?\",\n    answer:\n      \"Once a KYC profile has been fully submitted, it will go under review which can take up to 48 business hours. Pending review the user will receive an email notifying of an approval, rejection, or request for more information.\",\n  },\n  {\n    question: \"What do I need to complete KYC?\",\n    answer:\n      \"The typical requested information includes a government issued ID, proof of your residential address, your NEAR wallet, and a live selfie of your face. Be advised that KYC requirements may vary by region or be subject to changes in the future.\",\n  },\n  {\n    question: \"What if I do not have proof of my residential address?\",\n    answer:\n      \"Proof of your residential address is mandatory for your KYC profile to be approved.\",\n  },\n  {\n    question: \"Which NEAR wallet do I add to my KYC profile?\",\n    answer:\n      \"The NEAR wallet you add to your KYC profile will be the wallet that ultimately receives payment. NDC will not send payment to a NEAR wallet until it has been verified through your profile. If you wish to change this wallet in the future you can upload a new wallet address and it will be subsequently verified.\",\n  },\n  {\n    question: \"What happens if I don’t pass KYC?\",\n    answer:\n      \"If you do not pass this means you were either requested to submit more information or you were rejected. If requested for more information, you will need to submit the required information to be approved. If rejected, you will not be eligible to receive payment until you resolve the issue and your profile is approved.\",\n  },\n  {\n    question: \"Why was my KYC rejected?\",\n    answer:\n      \"There are many reasons you may have been rejected. Oftentimes it is because you have used a different email to create a different KYC profile, or you may have used a different email to complete another company’s KYC journey. Be advised you can only have one email associated with an approved KYC profile that is linked to your identity. Other reasons for rejection may include but are not limited to: residence in a sanctioned country, attempted/suspected fraud, or expired documents.\",\n  },\n  {\n    question: \"How do I fix a KYC rejection?\",\n    answer:\n      \"Depending on the reason for rejection, you can reupload corrected information which will undergo another review.\",\n  },\n  {\n    question: \"Can I receive payment if I was rejected?\",\n    answer:\n      \"No, you will not be eligible to receive payment until you receive an approved KYC profile.\",\n  },\n  {\n    question: \"Can someone else receive payment on my behalf?\",\n    answer:\n      \"This is only possible if both parties have received an approved KYC profile and they have communicated with the NDC in writing of their intentions. This is not recommended as an ongoing practice.\",\n  },\n  {\n    question: \"Can I receive payment if I reside in a sanctioned country?\",\n    answer:\n      \"Your KYC profile will receive a rejection if you reside in a sanctioned country. NDC will evaluate each rejected and sanctioned profile on a case-by-case basis, however, NDC does not guarantee any resolution leading to payment.\",\n  },\n  {\n    question: \"How do I bypass sanctions?\",\n    answer:\n      \"Any attempt to bypass sanctions would be considered a violation of AML guidelines. This will lead to you being blacklisted in NDC’s system and make you ineligible to receive payment at any time in the future.\",\n  },\n  {\n    question: \"Is my personal information safe?\",\n    answer:\n      \"Yes, your information is stored on secure servers by the KYC screening tool and will not be shared by any party.\",\n  },\n  {\n    question: \"Can I delete my information?\",\n    answer:\n      \"Yes, you can submit a request to delete your information by messaging: support@fractal.id\",\n  },\n  {\n    question: \"Will the KYC support email help me pass KYC?\",\n    answer:\n      \"NDC’s KYC support email compliance@neardc.org will not offer advice on how to pass KYC, however, NDC will do its best to answer questions regarding your profile.\",\n  },\n];\n\nconst questionSectionClass = {\n  background: \"#fff\",\n  border: \"1px solid #d6e0f1\",\n  borderRadius: \"10px\",\n  marginBottom: \"16px\",\n  color: \"#383e4d\",\n  overflow: \"hidden\",\n};\n\nconst accordionItems = questions.map((item, id) => {\n  const collapseTarget = `collapse${id}`;\n  const headerTarget = `heading${id}`;\n\n  return (\n    <div className=\"accordion-item\" style={questionSectionClass}>\n      <h4 class=\"accordion-header\" id={headerTarget}>\n        <button\n          className=\"accordion-button collapsed\"\n          style={{ fontSize: \"21px\", fontWeight: \"500\", boxShadow: \"none\" }}\n          type=\"button\"\n          data-bs-toggle=\"collapse\"\n          data-bs-target={`#${collapseTarget}`}\n          aria-expanded=\"false\"\n          aria-controls={collapseTarget}\n        >\n          {item.question}\n        </button>\n      </h4>\n      <div\n        id={collapseTarget}\n        className=\"accordion-collapse collapse\"\n        aria-labelledby={headerTarget}\n        data-bs-parent=\"#faq\"\n      >\n        <div className=\"accordion-body\">{item.answer}</div>\n      </div>\n    </div>\n  );\n});\n\nconst accordion = (\n  <div class=\"accordion\" id=\"faq\">\n    {accordionItems}\n  </div>\n);\n\nconst contactSection = (\n  <div className=\"mt-5 text-center\">\n    <h3>Still have questions?</h3>\n    <h5>\n      <b>Contact Us:</b> compliance@neardc.org\n    </h5>\n  </div>\n);\n\nreturn (\n  <>\n    <h2 className=\"m-3 text-center\">Frequently Answered Questions</h2>\n    <div className=\"row m-2\">\n      <div className=\"col-12 m-2\">{accordion}</div>\n      <div className=\"col-12 m-2 mb-5\">{contactSection}</div>\n    </div>\n  </>\n);\n", "metadata": null, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/identity.near/widget/faq", "fact_widget_deployments_id": "63e636479a6550d5083e544cc8f8ac2f", "inserted_timestamp": "2024-03-20T19:27:52.363Z", "modified_timestamp": "2024-03-20T19:27:52.363Z", "__row_index": 1}