{"tx_hash": "GcJEkcvAHAnWdGyzR4aSDwZcvn9hHS2Pfgh7nXEDVKvv", "action_id_social": "CKEwDCkYAQKJ1uhDFdCpDr6dMwgJYDFDg9ZUuvzBzAnu-0-widget", "block_id": 102431838, "block_timestamp": "2023-10-02T07:07:58.807Z", "signer_id": "nearcon23.near", "widget_name": "Terms.Content.Section3", "source_code": "const ownerId = \"nearcon23.near\";\n\nconst C1 = styled.span`\n    font-weight: bold;\n`;\n\nconst Container = styled.div`\n    padding: 8px 16px;\n    margin-left: 16px;\n`;\n\nconst LI = styled.li`\n  list-style-type: none;\n  margin-top: 10px;\n`;\n\nreturn (\n  <Container>\n    <ol start=\"14\">\n      <li>\n        <C1>General Conditions</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            14.1. The Foundation reserves the right, in its sole discretion, to\n            cancel, suspend and/or modify the Event (including, without\n            limitation, its content and/or scope) and/or the issue of any\n            Rewards, or any part of it, for any reason, without any liability.{\" \"}\n          </span>\n        </LI>\n        <LI>\n          <span>\n            14.2. The Foundation reverses the right to remove you from the Event\n            if it finds you to be acting in a manner that is inappropriate, not\n            in the best interests of the Event, or inconsistent with the\n            mission, values and objectives of the Foundation, or to be in\n            violation of the Terms, any Event Rules or any applicable law or\n            regulation. This Agreement shall terminate immediately upon your\n            removal from the Event by the Foundation pursuant to this Clause\n            14.2.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            14.3. The terms and conditions are subject to change at any time,\n            including the rights or obligations of the Attendee or the\n            Foundation. The Foundation will make the amended terms and\n            conditions available online. To the fullest extent permitted by law,\n            any amendment will become effective at the time that the amended\n            terms and conditions are made available online.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            14.4. The Terms (including, without limitation and if applicable,\n            any Reward Agreement), any Event Rules, and any other policies of\n            the Foundation referenced in the Terms, constitute the entire\n            agreement between you and the Foundation in respect of the Event.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            14.5. In the event that any provision in the Terms is held to be\n            invalid or unenforceable, the unenforceable part will be given\n            effect to the greatest extent permitted by law and the remaining\n            provisions will remain in full force and effect to the maximum\n            extent permitted by law.{\" \"}\n          </span>\n        </LI>\n        <LI>\n          <span>\n            14.6. The Terms, any Event Rules, and the rules, restrictions and\n            policies contained herein, and the Foundation&rsquo;s enforcement\n            thereof, are not intended to confer and do not confer any rights or\n            remedies upon any person other than you and the Foundation.\n          </span>\n        </LI>\n      </ol>\n    </Container>\n\n    <ol start=\"15\">\n      <li>\n        <C1>Links to other websites</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            15.1. The Event website contains links to other websites. We are not\n            responsible for the content, accuracy or opinions expressed in such\n            websites, and such websites are not investigated, monitored or\n            checked for accuracy or completeness by us. Inclusion of any linked\n            website on the Event website does not imply approval or endorsement\n            of the linked website by us. If you decide to leave the Event\n            website and access these third-party sites, you do so at your own\n            risk.\n          </span>\n        </LI>\n      </ol>\n    </Container>\n    <ol start=\"16\">\n      <li>\n        <C1>Nontransferable</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            16.1. Your right to attend the Event is not transferable. Any\n            ticket, password, or right given to you to obtain information or\n            documents is not transferable.\n          </span>\n        </LI>\n      </ol>\n    </Container>\n    <ol start=\"17\">\n      <li>\n        <C1>Code of Conduct</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            17.1. The Event aims to be an inclusive by-the-community for\n            the-community conference. We are dedicated to providing an accepting\n            environment that provides space for making friends and earning\n            knowledge regardless of gender, gender identity and expression,\n            sexual orientation, disability, physical appearance, body size,\n            race, age, religion or lack thereof. Harassment of Event attendees,\n            speakers, sponsors and any others will not be tolerated at the\n            Event. Event participants violating the Code of Conduct may be\n            sanctioned or expelled from the Event.\n          </span>\n        </LI>\n        <LI>\n          <span>\n            17.2. To maintain an accepting environment, the Foundation condemns\n            the following behavior (but not limited to) as being wholly\n            unacceptable at the Event:\n          </span>\n        </LI>\n      </ol>\n      <Container>\n        <ol>\n          <LI>\n            <span>\n              17.2.1. Offensive verbal comments related to gender, gender\n              identity and expression, sexual orientation, disability, physical\n              appearance, body size, race, age &amp; religion\n            </span>\n          </LI>\n          <LI>\n            <span> 17.2.2. Sexual references/imagery in public spaces</span>\n          </LI>\n          <LI>\n            <span>\n              17.2.3. Deliberate intimidation, stalking, or following.\n            </span>\n          </LI>\n          <LI>\n            <span>17.2.4. Harassing photography or recording.</span>\n          </LI>\n          <LI>\n            <span>17.2.5. Sustained disruption of talks or other events.</span>\n          </LI>\n          <LI>\n            <span> 17.2.6. Inappropriate physical contact.</span>\n          </LI>\n          <LI>\n            <span> 17.2.7. Invasion of personal space.</span>\n          </LI>\n          <LI>\n            <span> 17.2.8. Unwelcome sexual attention.</span>\n          </LI>\n          <LI>\n            <span>\n              17.2.9. Advocating for or encouraging, any of the above behavior.\n            </span>\n          </LI>\n        </ol>\n      </Container>\n\n      <ol>\n        <LI>\n          <span>\n            17.3. If you are subject to unacceptable behavior, notice that\n            someone else is being subject to unacceptable behavior, notice any\n            other breach of the Code of Conduct, or have any other concerns,\n            please follow these steps:\n          </span>\n        </LI>\n      </ol>\n\n      <Container>\n        <ol>\n          <LI>\n            <span>\n              17.3.1. Let the person know that what they did is unacceptable and\n              ask them to stop.\n            </span>\n          </LI>\n          <LI>\n            <span>\n              {\" \"}\n              17.3.2. That person should immediately stop the behavior.\n            </span>\n          </LI>\n          <LI>\n            <span>\n              17.3.3. If that person doesn&rsquo;t comply, please contact Event\n              staff as soon as possible. Event staff can be identified through\n              branded shirts/badges or alternatively can be contacted at:{\" \"}\n            </span>\n            <span>[INSERT EMAIL].</span>\n          </LI>\n          <LI>\n            <span>\n              17.3.4. Event staff will ensure your safety and maintain desired\n              privacy.\n            </span>\n          </LI>\n          <LI>\n            <span>\n              17.3.5. Event staff members will take immediate actions against\n              persons violating the Code of Conduct.\n            </span>\n          </LI>\n        </ol>\n      </Container>\n    </Container>\n    <ol start=\"18\">\n      <li>\n        <span></span>\n      </li>\n      <li>\n        <C1>Governing Law and Jurisdiction</C1>\n      </li>\n    </ol>\n    <Container>\n      <ol>\n        <LI>\n          <span>\n            19.1. The Terms and any dispute or claim (including non-contractual\n            disputes or claims) arising out of or in connection with it or its\n            subject matter or formation shall be governed by and construed in\n            accordance with Swiss law, excluding the Swiss conflict of law\n            rules. The application of the United Nations Convention for\n            Contracts for the International Sales of Goods is hereby expressly\n            excluded.{\" \"}\n          </span>\n        </LI>\n        <LI>\n          <span>\n            19.2. Any dispute, controversy or claim arising out of or in\n            connection with the Terms or the breach, termination, existence,\n            legal competence or invalidity thereof, shall be exclusively settled\n            by the courts of Zug, Switzerland.\n          </span>\n        </LI>\n      </ol>\n    </Container>\n  </Container>\n);\n", "metadata": {"platform": "jutsu.ai"}, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/nearcon23.near/widget/Terms.Content.Section3", "fact_widget_deployments_id": "9a9014d58028fbfb7ca653f367915368", "inserted_timestamp": "2024-03-07T05:24:05.087Z", "modified_timestamp": "2024-03-07T05:24:05.087Z", "__row_index": 0}