{"tx_hash": "7BGt5eHmjrxtz64wDZ89H3F3fL3JPtC6sxCqXAF7GkzR", "action_id_social": "FSoNpC5oRc6RaJezpS4pev8ZzdykkgqboUAZbx46KB9M-0-widget", "block_id": 111764412, "block_timestamp": "2024-01-31T10:21:05.455Z", "signer_id": "anupam9873.near", "widget_name": "Onboarding.Starter-fork-fork-fork-fork-fork", "source_code": "return (\n  <div>\n    <h3>Little Bit About Me</h3>\n    <p>\n      My Name is Anupam, originally from India, I have a Bachelor Degree in\n      Computer Science & Engineering.\n    </p>\n    <p>\n      I am a dedicated and results-driven Data Engineer with a strong passion\n      for transforming data into actionable insights. With years of experience\n      in the Software industry, I have honed my skills in designing,\n      implementing Applications, and optimizing data pipelines to fuel informed\n      decision-making.\n    </p>\n    <ul>\n      <li>\n        📊 Data Alchemist: I specialize in the art of data extraction,\n        transformation, and loading (ETL) and have a proven track record of\n        developing robust ETL processes using tools such as [list relevant\n        tools, e.g., Apache Spark]. I thrive on the challenge of efficiently\n        handling and processing large datasets to unlock their potential.\n      </li>\n      <li>\n        🛠️ Tech Enthusiast: I am deeply committed to staying at the forefront of\n        technological advancements in the data engineering landscape. My toolkit\n        includes [list relevant programming languages, databases, and\n        frameworks, e.g., Python, SQL, PySpark, AWS Services like Glue, Lambda,\n        EventBridge, Stepfunction, SNS, SQS, Dynamo DB etc. and I relish the\n        opportunity to learn and adapt to new tools and technologies as they\n        emerge.\n      </li>\n      <li>\n        🔗 Data Architecture Maven: I understand the importance of a\n        well-architected data ecosystem. I have experience in designing and\n        implementing data lakes and data marts, ensuring data is structured and\n        accessible for analytics and reporting.\n      </li>\n      <li>\n        🔧 Problem Solver: Data engineering is all about tackling complex\n        challenges head-on. I have a proven ability to troubleshoot issues,\n        optimize performance, and ensure data quality, resulting in efficient\n        and reliable data pipelines.\n      </li>\n      <li>\n        👥 Collaborative Team Player: I thrive in cross-functional teams and\n        believe that great data engineering is built on effective communication\n        and collaboration. I have experience working with data scientists,\n        analysts, and business stakeholders to align technical solutions with\n        organizational goals.\n      </li>\n      <li>\n        🌟 Passion for Continuous Learning: In the ever-evolving field of data\n        engineering, I am committed to continuous learning and professional\n        growth. I actively engage with the data engineering community,\n        participate in meetups, conferences, and open-source projects, and\n        constantly seek ways to enhance my skills.\n      </li>\n      <li>\n        🚀 Always Ready for meeting with sharp & ambitious people to talk about\n        different ideas to solve problems & make an impact\n      </li>\n    </ul>\n    <h2>Interest & Hobbies</h2>\n    <p>\n      Travelling, Talk about Finance, Charity, Community Building, Health &\n      Wellness\n    </p>\n    <h2>Perfect Place to Meet & Talk</h2>\n    <p>Tech Meetups, Charity/Social Events, Walk & Talk in the Park</p>\n    <h2>Project:</h2>\n    <ol>\n      <li>GPS module</li>\n      <li>Hangman</li>\n    </ol>\n    <h2>Connect on</h2>\n    <ul>\n      <li>Telegram: Anupam</li>\n      <li>Twitter: anupam3792</li>\n\n      <li>Email: sihi457@gmail.com</li>\n      <li>Mobile: 2012757410</li>\n    </ul>\n  </div>\n);\n", "metadata": {"fork_of": "near/widget/Onboarding.Starter@90335242"}, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/anupam9873.near/widget/Onboarding.Starter-fork-fork-fork-fork-fork", "fact_widget_deployments_id": "3c5ce2eff99586dd03b93b3dba952cbc", "inserted_timestamp": "2024-03-07T05:24:05.087Z", "modified_timestamp": "2024-03-07T05:24:05.087Z", "__row_index": 0}