{"tx_hash": "ETk6w55KCBv3ZfTpTTpWu4JS1UoEyFxxpVRe7wUo13uy", "action_id_social": "77avruUN8f8UHjPda7nrv33iSSJhA6ryP9EVUypgndx2-0-widget", "block_id": 101217780, "block_timestamp": "2023-09-16T00:41:11.553Z", "signer_id": "wendersonpires.near", "widget_name": "To-do", "source_code": "return <div>Hello World</div>;", "metadata": {"description": "## Overview:\nThis App is a streamlined task management tool designed to help users organize and prioritize their tasks more efficiently. Unlike traditional todo list apps, this application introduces a two-tier system: tickets and tasks within those tickets. This hierarchical structure ensures that users can group related tasks together, providing a clearer overview of their responsibilities and projects.\n\n## Features:\n\n**Ticket Creation:** Users can create tickets that act as primary containers or categories. Each ticket can represent a project, a day, an event, or any other grouping mechanism the user finds relevant.\n\nTask Management: Within each ticket, users can add individual tasks. This allows for a detailed breakdown of what needs to be done for each project or category. Tasks can be added, edited, or marked as completed with ease.\n\n**Hierarchical View:** The app provides a clear distinction between tickets and the tasks they contain. This ensures that users can quickly identify and navigate through their tasks, making the management process more intuitive.\n\n**Prioritization:** Users can prioritize tasks within tickets, ensuring that the most critical tasks are addressed first. This feature is especially useful when managing projects with multiple steps or stages.\n\nSimple and Intuitive Interface: The app boasts a user-friendly interface, making it easy even for those who are not tech-savvy to navigate and manage their tasks.\n\n## Benefits:\n\n**Organized Workflow:** By grouping tasks under tickets, users can maintain a more organized and structured workflow. This is especially beneficial for those managing multiple projects or responsibilities.\n\n**Enhanced Productivity:** With a clear view of tasks and their respective categories, users can tackle their responsibilities more systematically, leading to increased productivity.\n\n**Flexibility:** Whether you're planning a personal project, organizing daily chores, or managing work-related tasks, the Todo Ticket App adapts to various needs, offering a versatile solution for task management.", "image": {"ipfs_cid": "bafkreiahfyoqkpzoxrrun6ocqakr33ecgliqykkll5tsx6pm3mubrbof5i"}, "name": "To-do"}, "branch": null, "widget_modules_used": null, "widget_url": "https://near.social/#/wendersonpires.near/widget/To-do", "fact_widget_deployments_id": "a1f34f62e29f7caf875a8a3152661113", "inserted_timestamp": "2023-09-16T02:32:53.407Z", "modified_timestamp": "2023-09-16T02:32:53.407Z", "__row_index": 2}